{"columns":["asin","category","questionText","questionType","review_snippets","answers","is_answerable","qid"],"data":[["B000MP20BU","Toys_and_Games","Many have stated similar to the following: \"Paint Chips Off Easily; Pieces are MDF, Not Wood\" is this correct or an inaccurate uneducated statement?","descriptive",["A lot of reviewers have said things about this puzzle not being that durable, but we've had ours over a year now and it hasn't lost even a speck of paint or chipped any wood at all. My kids love it. The puzzle pieces are durable and sturdy. My kids march the dinosaurs around and pretend games with them as well as just doing the puzzle. I am glad I bought this for them.","It's intentionally deceptive marketing, but does any of that really matter in the practical sense?I think it does.Medium density fiberboard (MDF) is nasty stuff. Containing a higher resin-to-wood ration than any other pressed wood product, MDF emits VOCs for at least a few months after manufacture and emits urea formaldehyde for the duration of its life.","As the paint wears away, it becomes apparent that these puzzle pieces are nothing but pressed paper-like sawdust material. When revealed beneath the chipped-off paint, this dry, dusty substance easily flakes off where it can get into little mouths and become part of the general household dust.Okay, so Melissa and Doug fudged a little on their description, which was prominently displayed on the packaging for our puzzle.","Also, since the side and back is not painted on each piece, the MDF is a little rough and scratchy for little hands and it blends in with the carpet, they are constantly being stepped on when they end up on the floor. The farm animals puzzle pieces were individually painted however, and this made up for the MDF on these.","I have to say I'm very disappointed with the quality of this puzzle and in Melissa & Doug for allowing their products to be produced this way. They have been known for the quality of their wooden toys but it seems that quantity now matters more. I gave it 3 stars only because my twins seem to like playing with them.I purchased this puzzle along with the \"farm animals\" one and they are both made from MDF, but as others have said the pieces on this one were not individually painted.","very sturdy wood pieces. my son loves the bright colors. well built, not like some of the cardboard ones out there. will definately order another one","My 22 month old son loves this puzzle. The pieces are easy for him to pick up and he has learned to \"adjust\" each piece so it fits into its correct slot.","as others have pointed out, the pieces aren't \"wood\" in any sense that the average buyer would agree. they're not cut out of solid pieces of dried tree. and when they start to go - or when a dog gets ahold of one, or a child with a particularly tenacious chewing habit, they disintegrate in minutes.I am sorely disappointed in the company - misleading labeling guarantees I won't be a repeat buyer.","I was very dissapointed in this puzzle!! The quality is NOT \"good\" as in the description, but very POOR!! My one year old son received it yesterday as a birthday gift and my inital excitement over this very colorful and pretty seeming puzzle turned into mere dissapointment: in a matter of only 5 minutes a piece of the ply wood (the puzzle is made of) came off one of the pieces! My son could have swallowed it, if I would have not noticed.","This is from all external appearances a great little puzzle. It's certainly a great concept for a 'first' puzzle, with it's bright fun aesthetically-appealing dinosaurs and easy-match puzzle board. It is certainly educational, and when I bought it I felt pretty good about my kids playing with it.We own the older style - painted 'wooden' pieces. When I think wooden, I think solid wood, which is what these pieces appear to be."],[{"answerText":"The paint has held up through two toddlers and still going strong, no issues there. I haven't had any paint chip. The puzzle board is made of manufactured wood but the actual puzzle pieces are solid wood. I think it is very well made.","answerType":"NA","helpful":[1,1]},{"answerText":"I gave this to my niece's son for his 2nd birthday and she states that he plays with the pieces like action figurines and has had no problems as described in the other comments. I personally have bought many, many Melissa & Doug puzzles and other items over the course of many years and have always found them to be of high quality.","answerType":"NA","helpful":[1,1]},{"answerText":"Yes they seem to be made of MDF and it is a fact that the paint chips off on the edges where they impact when repeatedly thrown or dropped, not too unrealistic a reality.  I think from a green recycling perspective I'de rather they we made of MDF than solid wood, it saves allot of trees this way, and these amazing puzzles are not very expensive.  I am pleased with mine, Oh' and so is Baby! lol","answerType":"NA","helpful":[0,1]},{"answerText":"The board looks like plywood and the pieces feel heavy like wood to me. I could not see any paint coming off- not even from the same puzzle at the library. I would think with such heavy use those pieces would show significant wear. That after a year or more, the library's pieces are in good condition testifies to the high quality of Melissa & Doug products.","answerType":"NA","helpful":[0,1]}],1,0],["B00BOXZZU2","Health_and_Personal_Care","Will these work with the Phillips sonicare handles?","descriptive",["I didn't even realize such a small electric tooth-brush existed till I accidentally found the toothbrush at an outlet store. Now I have a very pretty & slim brush for my purse and traveling. These replacement brushes work great and are well-priced.","I bought the Violife sonic toothbrush for travel. It came with one replacement head, but I was thinking ahead and bought this pack. Will last through the year as I travel and change heads about 1x per month. The toothbrush it's self is so much smaller than the sonic I use at home. It's not quite as &#34;strong&#34; but I think it does an exceptable  job. I also bring along a spare battery or two just in case. Hope this info is useful.","Exactly what I needed. There is nothing else to say about toothbrushes! One two, three, four, five, six. seven, eight."],[{"answerText":"The answer unfortunately, is no. The Slim Sonic is a compact device suitable for travel. The heads do not fit my Phillips Sonicare machine.","answerType":"NA","helpful":[1,1]},{"answerText":"Sorry am unable to answer your question","answerType":"NA","helpful":[0,1]},{"answerText":"I'm afraid I don't know.  My handle says Slimsonic Violight--no other indication of manufacturer.","answerType":"NA","helpful":[0,1]}],0,1],["B00CSYD4M2","Cell_Phones_and_Accessories","What kind of sim card it use?","descriptive",["I bought this phone a few weeks ago.I am using it in Costa Rica with a Kolbi (ICE) sim card and works great!!! Its small and powerful, the only problem is the battery that does not last too long but other than that, Im very happy with this product!! !","It will work with any phone carrier that has Mini Sim cards or smaller. My old phone took a micro sim card. If you position the card right it will work. The wifi is great on the phone with no lag at all. If you are one for constant speed with having lots of apps running at the same time this is not the phone for you.","This phone is a really nice phone. It has 1GB RAM with 2GB storage. If you do buy this phone I recommend you get a micro sd card. It makes the space alot bigger. The phone is not good for gaming. The processor is only a single core so it can only do one thing at once. It is a 3G phone. The battery life is really good. The phone lasts a couple days on standby and 1 day with constant use.","I was looking for an unlocked phone . I travel between south America, US and Canada. The phone is small enough and solved m need. Just buy a SIM card and it works. Keys are small but that is to be expected. Recommend t phone and the price is right.","Also you can not manually tune in a station as the receive only does a scan on those that are available; however, you can enter the station frequency, if you know it. I also like the Wi-Fi and Bluetooth capabilities. This unit uses GSM technology and requires a SIM card so it can be used overseas once you get a provided and their SIM card. Yes it's not an Apple I-Phone or a Galaxy S5 or Mini but it doesn't cost a bundle or a 2-yr contract.","I like the phone. It's just a little bit smaller than I thought it would be. Overall the phone is easy to use.","Its very user friendly. Battery last longer than originally thought it would. Simple to set up and use. I enjoy using it.","Just wish Android did not have so many apps pre-installed on the phone that we never intend to use. It really bloats the home screens and app screens. Althought that may have nothing to do with the Samsung, but with Android itself.","my old phone broke and I needed a new phone. I saw all the great review this phone had and decide to buy it and I am very happy with it, great phone for every day use. delivery was quick.","I can only rate this phone by it's look because i bought it for a relative in a different country. The only set back is the picture is very deceitful based on the size. It looks bigger in picture that it really is. I powered it up and it is in working condition. I will have my relative give me feed back after use."],[{"answerText":"This phone is an unlocked GSM device, it requires a MINI SIM (regular size)","answerType":"NA","helpful":[3,3]},{"answerText":"Hello, I use simcard movistar Venezuela.","answerType":"NA","helpful":[1,1]}],1,2],["B00C5TNSRG","Home_and_Kitchen","does anyone know if this dinnerware set does not contain lead or traces of lead or cadmium?","descriptive",["I love my new dishes! They are so versatile. I can set a casual table and yet set a very beautiful table for special occasions. EVERYONE wants to know where I got them- haven't seen any like them in stores. Again, I LOVE MY NEW DISHES!!! !","This is as expected. Beautiful set of dishes. Very light weight.","I love that the plates are square, they sit so nicely in my cupboard. I can't wait to get another set!","This set is just beautiful. I have wanted white dishes forever but just could not find what I really loved and yet could use all the time. They are just what I needed. Everyone loved them at !!!!! !","Which makes washing dishes enjoyable.I definitely say YES to buying this item. I would be thrilled if they made serving platters for this design as well.By far, this is the best set I have owned! I love it...Enjoy!","The Corelle Cherish Square design is wonderful to look at as it is displayed on the shelves at Bed, Bath, and Beyond.The brand is well worth the cost, however - I was even happier when I got it at a &#34;mistaken price&#34; 99.00 when other boxes were priced at $109.00."],[{"answerText":"According to the internet search:   three-layer glass laminate called Vitrelle® glass","answerType":"NA","helpful":[0,0]},{"answerText":"Several organizations have tested these, it depends on how sensitive their testing method is. That said, the all corelle vitrelle  tends to test lead free. High sensitivity testing, says otherwise. Google it and decide for yourself if these are right for you.","answerType":"NA","helpful":[0,0]}],0,3],["B0099XQBD4","Musical_Instruments","I'm thinking of getting in to modular synthesizers.  Would this work for that?","descriptive",["Will order another in the near future and arrived very quickly. Easy to install with little technical know how and would replace if damaged or stolen.","I purchased this when getting back into DJing. I have 2 15\" 3 way main speakers, a 15\" Sub-woofer, and a 12\" Monitor speaker, and the sound is excellent!","you can not complain about this product.. no feedback, and great inputs and outputs. In the future, I might just buy a couple 8000 watt amps, and see how things go... Maybe I can do some serious parties somewhere.","the amp is not too bad for the money  am running a three sytem for reggae music am useing  it to run two pv 15 for mid  on it holding up good","100% love this amp... I have a pyle PMX602M powered amp with many hookups and an EQ, and I have no problem with this amp. maxed out my sound and modified my EQ, and I have overpowered this amp, but still held up and kept the sound clear... I will be buying 3 more of these, and I will be hooking up some serious sound systems."],[{"answerText":"Yes it will.","answerType":"NA","helpful":[1,1]},{"answerText":"Not sure. I've run a keyboard controller through it and it works great","answerType":"NA","helpful":[0,1]}],0,4],["B002HD7ZOW","Baby","Is this a foam mattress or does it have coils\/springs?","descriptive",["My baby has only used the crib a few times and so far he sleeps good. The mattress isn't too soft.","No faults were discovered in this mattress. Organic hopefully means no chemicals which is the major problem with most baby mattresses.","I bought this mattress as the one that came with the mini crib I ordered was so thin. My grandson, sleeps very well on this mattress.","I bought this mattress for my DaVinci Alpha Mini Rocking Crib and it fits perfectly, no gaps. It is not too firm or too soft but the perfect balance.","This is a great mattress for the price - especially since it is organic. You may want to purchase a waterproof mattress cover if you are worried about staining, or not if you are worried about off gassing.","Much better than the mattress that comes with the mini crib. My 8 mo old slept fine on it with the mattress pad and sheet. Would be more happy with it if it was all organic.","No chemical smell, came very quickly. Fits the davinci mini alpha perfectly. An excellent value, especially for those who want a new mattress without toxic chemical worries.","I really like this mattress and its not to firm and not to soft. I would love to sleep on it if I were a baby! It fits my Mini Rocking crib perfect! This mattress has no chemical smell","The mattress is wearing well. It seemed a little hard at first, but the old one sagged in the middle, so it may be just perfect in the long run and soften up a bit so the baby can be cozy AND supported.","We have the DaVinci Emily portable crib and this mattress fits perfectly. It is a great thickness. I still haven't found sheets that fit it well but the standard size sheets work for now, they're just a bit big."],[{"answerText":"It is foam.","answerType":"NA","helpful":[0,0]},{"answerText":"It's foam. It's not super soft, pretty firm.","answerType":"NA","helpful":[0,0]},{"answerText":"It's not foam, I think it has springs.","answerType":"NA","helpful":[0,0]},{"answerText":"No coils..","answerType":"NA","helpful":[0,0]}],1,5],["B004OVLSOS","Sports_and_Outdoors","I am about 235 and 6'3. I am not looking to go commando on this thing and attempt to tip it over, but I would however like to know if would hold up?","descriptive",["Just like many of the other reviews state this product is sturdy and well made. Pull ups and dips are great on this. If you are looking for a pull up bar to do p90x or insanity asylum this is the way to go. It is also easy to put together it took me 15 minutes.","I mainly bought this for the pull up bar, however the bar is so close to the back of the machine that when doing pull ups it is hard not to hit your knees on the back of the tower. It was also very difficult to put together, as many of the bolt holes didn't line up. It's well priced but if you want something really nice for your gym I would consider looking around.","I am 6'3\", 230lbs and using the chin up bar to the dips, this is a sturdy and solid piece of equipment. The roman chair is comfortable and positioned high enough that my feet do not touch the floor with legs extended. I have not used the rollers to hold the feet for sit ups due to limited space.","This thing works, just like it's supposed to. It's very well made, but pay attention to the directions, I was assembling this and started to panic a bit thinking they didn't include all the hardware I needed (Which I was also confused why, because they package it very well with all the nuts\/bolts in one vacuum sealed package).","This is a great multi use workout tower. It is a very sturdy piece of equipment. It feels very stable when using it for pull ups - where other towers felt like they could tip over","I'm 6'3 & wt. 205 lbs. and it handles my ht. & wt. with no problems.....would recommend product to my friends and any one else!! !","Great product, very sturdy. Price was very reasonable. Takes a little time to set up, but it was not too bad. Once you get going, it goes together fairly quickly. The tower is incredibly sturdy; does not tip or bend at all. Very impressed with the quality of the product, I would recommend it to others.","This is a good piece of exercise equipment for the money. I would recommend it to a friend. It works well for dips, chin ups and leg lifts. The only small draw back is that you have to slightly arc your lower body away from the frame when doing chin ups othewise you might bump into it like I did.","I was looking for a power tower unit for quite a while before I fell on this gem.","I was very impressed with how nicely built and equipped this unit is. Assembles with ease and is great looking"],[{"answerText":"It might tip over unless you add weights to counterbalance it.  When My nephew (5'11\", 200lbs) did pull-ups on it, i stood on the other side to offset the tilt of the station.","answerType":"NA","helpful":[2,2]},{"answerText":"Hey Nicholas, I am 194 and 5'10.  I never for a moment felt that I could make this unit tip over.  It always felt stable and sturdy.","answerType":"NA","helpful":[2,2]},{"answerText":"I was 263lbs 6'2 when I first bought this and I must say it is very robust and durable. If you shake a lot it will move a little bit but they all will if it's not bolted down to the floor. If was a great buy for me and I love. P.S. make sure you have at least 8' ft ceiling or higher the better because this thing is tall.","answerType":"NA","helpful":[2,2]},{"answerText":"Yes my son and husband use it a lot. It is very sturdy and well built.","answerType":"NA","helpful":[1,1]},{"answerText":"It will hold up as I go commando on this every morning.  However, my neighbors constantly complain and demand I wear shorts or just close the shade.","answerType":"NA","helpful":[0,0]}],1,6],["B006JUKXH0","Patio_Lawn_and_Garden","I am from Kentucky, USA, Would the creeping thyme grow well in this region?","descriptive",["Very nice. Not the super low creeping thyme I originally wanted, but I have that now and this seems to be much hardier.","So far nothing has grown, I would recommend looking into this flower history before buying. You will want to make sure that you are in an area that this plant will grow.","I have planted quite a few creeping thyme seeds into rock crevices that contain soil. This seeds that came in this shipment did not produce as I had hoped. I am still waiting for the seeds to germinate.","I received them on time, planted them and 6 plants are thriving..However, all of the websites that I have checked for creeping thyme seedling identification, look nothing like what is growing in my pots. I suppose I'll see if they start blooming.","Arrived quickly. Bag seemed smaller than what I would expect but then again 1000 seeds that are so very small, hmmmm. I have sown it and the little plants are coming right up and about a week. Hope that the thyme is as pretty as the pictures.","Love buying seeds from Amazon, always a great value and they almost always do well, alot depends on the degree of gardener you are. If anyone is unhappy with a seed purchase you should do research on that particular plant or seed before buying, sometimes the rarer the plant, the harder to grow, especially if it is a tropical. But so far so good. These little guys sprout up nicely and grow nicely.","So far this is doing well! I  bought this to go in between some garden pavers and planted the seeds directly outside. Plants have come up and seem to be doing well.","Was hoping to cover a sunny but bare spot in my yard, alas, nothing grew. Oh well might try again in the spring with the seeds that remain.","I ordered 3000 seeds and have tried planting four different times in different conditions and have not seen one single sprout. Definitely not a big financial loss but too bad they don't grow....","I got these seeds within a few days of ordering. Came with full instructions & a reusable packet. They even sent free seeds so it was definitely worth the cash & i can't wait to see them grow! I highly recommend this buy & company!"],[{"answerText":"Since you are in a more moderate climate than PA I would guess that you should have no problem","answerType":"NA","helpful":[2,2]},{"answerText":"Yes !","answerType":"NA","helpful":[0,0]},{"answerText":"I am not positive as I live in CA and our weather here is pretty moderate. I would probably check with your local University's Horticulture Dept or Nursery or Garden Center. Good luck.","answerType":"NA","helpful":[0,0]},{"answerText":"Hey There, I am in NC but sent those to my sis in California for a present, so I don't know for sure, but I imagine they would do fine at least as an annual as long as it gets full sun. Good Luck","answerType":"NA","helpful":[0,0]},{"answerText":"Yes, creeping thyme will grow very well for you.  I'm in northern Indiana and my creeping thyme winters over, reseeds, and has spread nicely over several years with no extra effort on my part.  I planted mine in full sun in well drained but nutrient-poor soil.   I used starts from our farmer's market, however, not seeds from this supplier.","answerType":"NA","helpful":[0,0]}],1,7],["B00GU4F4OM","Video_Games","Will this mouse work with Windows 8.1? I have been seeing some reviews of some that have issues with 8.1 for some reason...","descriptive",["It would be alright for a claw style grip but I use a palm grip. My main issue is the included software. I'm a Windows 8.1 user with a high end laptop. I started having issues with the apps page. The icons would go blank. Other quirky things too. Browser freezing. I looked at the website to check for updated software and google kills the download as malware. Not sure of the problem but as soon as I removed the software all went back to normal.","I have large hands and use a palm grip on the mouse. The right side of this mouse doesn't fit my fingers well. It has a texture on it that I have never felt on a mouse. Haven't decided if I like that or not. It functions perfectly in windows 8.1. The software is easy to use. It's very \"glowy\" but it doesn't drift, tracks nicely on my gaming mouse pad. Overall it's good.UPDATE; I've had the mouse for a week now.","Arrived in less time then expected.Connected into the operating systems windows 8 without any problems.Works with Diablo 3 without at problem.My stats have improved with this mouse","This mouse is awesome ,  i love the ergonomic feel to it . As a palm grip gamer , i would say the mouse shape structure is designed for it . The width of the mouse is perfect for the average size man hands and seats all fingers well in the grooves of the mouse.With all intergrated mouse accelerations disabled in Windows 7\/8 the movement is point for point accurate at an extremely high dpi of 16400!","The mouse was delivered quickly and came with a mini-CD with the drivers on it. It was up and running in no time with no issues. The mouse has a great feel to it and the customization is awesome. I would definitely purchase it again if I had to.","Her son is writing this BTW.When I got this mouse I was very excited, I opened the package to reveal that everything included in the package was there. The mouse had a nice braided cable and the plastic seemed pretty sturdy to me. So I plugged it in and Windows automatically installed the drivers.","You can change the color and speed of the pulsing lights. Though, if you choose a light color, many of them look the same. Darker colors show up better.Mouse feet, sliding, all that feels good on a regular no-frills mouse pad.The cord is braided and quality.I feel it was a good value for $40. So far no compatibility issues.","First of all, I only got this mouse because it looked big and I didn't like that my ring finger sat so close to my pinky finger in my old mouse. This mouse fixed that problemPros: It's bigNice qualityCool lightsMoves smoothlyCheapCons: Fuzzy feeling (still not used to it)My wrists started to hurt for some reason after using it","It worked fine though and had many option for changing the color and periodicity of the light.To sum it up, this mouse has worked extremely well for me. I got used to it in about 2-3 days and have improved my game play ever since. If you purchase this mouse or another high dpi mouse, be sure to turn off the windows acceleration and use one of the preset dpi configurations.","4\/24\/14 My initial impression so far is this mouse is really impressive. The mouse is really ergonomic, it has these grooves that are perfect your fingers to rest on. Also, has a 3 extra button that can be customized to your liking. It comes with 8 weights that can be tweaked to your preference, I removed all of mine. Additionally it has 5 dpi setting to 16400 which is way more than you'll ever need and has 5 profiles so you can customize for your different games."],[{"answerText":"Yes, it works without any problem... Tested for 4 months","answerType":"NA","helpful":[1,1]},{"answerText":"This mouse is really good.I use it for World of Warcraft and league of Legends.Works with windows 8.1. very comfortable.I would challenge it against Razor Brand any time.","answerType":"NA","helpful":[1,1]},{"answerText":"It worked great with my windows 8.1 I love this mouse best you can get for the price","answerType":"NA","helpful":[0,0]},{"answerText":"I have no problems","answerType":"NA","helpful":[0,0]},{"answerText":"It works perfectly fine with windows 8.1","answerType":"NA","helpful":[0,0]},{"answerText":"It works perfectly fine with windows 8.1","answerType":"NA","helpful":[0,0]}],0,8],["B0009H56DU","Pet_Supplies","Is this airline approved for in-cabin travel? United Airlines has a maximum 18x11x11 for soft-sided, but I was wondering if it is airline approved.","descriptive",["I had a hard time finding just the right carrier at a decent price. I have an 18-pound Jack Russell. He just barely fits the airline dimensions and it wasn't easy to find a bag that would accommodate his weight and the dimensions. This bag did it though. It doesn't have a lot of pockets and wheels would have been nice but it did offer maximum interior space for my little guy to be comfortable. It is soft-sided so it squeezed under the seat.","(The sides of the older model popped into place and were secure when you fitted the bottom piece in place - not so on this new version.) It is such a notably poorly constructed and designed item that I decided it was unsafe to even test, and returned it to Amazon. Such a shame. The soft-sided pet taxi that Petmate used to make was great. This new version is not safe or comfortable for a pet to travel in, and a waste of money.","Just the right size for airline travel, fits my tabby cat just fine. She thinks its her new cave. I look forward to traveling more with my beast.","I've used this for flying with my pug (in cabin). She is 23 lbs and *just* fits. It is the absolute largest carrier that most airlines will allow. The carrying handles and strap are really convenient depending on the situation. It is well ventilated so my pug always has plenty of airflow. The only minor complaint I have is the clips for the shoulder strap don't seem all that sturdy, but they haven't broken.","airline-approved and my dogs love it. when i leave one out, they fight to be in it first, then both end up squishing each other to sit inside. awesome carrier, or maybe funny dogs?","I ordered 2 of this item and when it arrived I was very pleased with the product. I needed these for airline travel and they had a large amount of ventilation on all 4 sides, zipper closed smoothly, easy access from the top or the end, fuzzy fleece like material for the bottom and a good stiff frame that still folds flat once used. I would give this product 5 stars instead of 4 if my cat hadn't popped through and escaped up my leg during the flight.","I purchased a Petmate Soft-Sided Pet Taxi years ago, and it was a wonderful purchase. My cat traveled many trips by air and car comfortably in it. I don't know when they \"updated\" this product, but the changes make it completely useless. The dimensions listed are not correct. It is 19\" x 11.25\" x 11\".","The thing was excellent, but everything has to go eventually, and I wanted to try something that would fold up nicely when not in use. I also wanted something that was easy to clean since not all of my cats have been good travelers. I was very wary of a soft-sided carrier, though, because I didn't want the animals to claw right through the mesh and escape.","This is our second Petmate Soft Sided Pet Taxi. We recently acquired a new puppy and needed another carrier. I like the ease of getting the pets in and out without hassle with the option of using the opening on the top or on the end. The sides give ventalation on the warm days and allows our pets to see what is going on around them. We all appreciate the removable, washable cover that covers the support board in the bottom of the carrier. This carrier has a sturdy carry strap.","My husband and I needed a pet carrier ASAP for our 6 month old Boston Terrier\/Schnauzer mix puppy. We were traveling home for the holidays and had planned on taking our dog with us on the plane. I had purchased one from PetCo but when I got it home it was way too small. I was able to find this one on Amazon.com that was the exact size of the largest soft sided carrier we could bring onto the plane with us as a carry-on."],[{"answerText":"Yes it is, I just flew American Airlines and United with it. And to be honest none of the airlines really care because it's a soft bag so it can squish under any seat and the people at the airport never really measure those.","answerType":"NA","helpful":[1,1]},{"answerText":"I just used this carrier in the cabin on United Airlines in July of 2014.  We have a 12 pound poodle that used the carrier.  We were on both large and small planes and the carrier worked on all of the planes.   It fit nicely under the seat.  I did have to flex it a little to slide it under the seat.  When we were flying, the airline never measured the case or checked the size. I still recommend following the guidelines because the dimensions are designed to fit under the seat.  I would buy this again.","answerType":"NA","helpful":[1,1]},{"answerText":"Not sure it has officially says airline approved, the size is within their regulations and air ventilation plus if accident the floor would absorb.  Also, my dog Bones was transported on United from Ohio to California in-cabin using this bag.","answerType":"NA","helpful":[0,0]},{"answerText":"I believe it is. I would check with the manufacturer.","answerType":"NA","helpful":[0,0]},{"answerText":"Yes","answerType":"NA","helpful":[0,0]}],1,9],["B00A6T10KY","Tools_and_Home_Improvement","Can anyone tell me how they would describe the color of the light? I need a warm color light (more yellow than blue)","descriptive",["Fits perfectly on post - looks great and emits just enough light. Would recommend this to anyone for use on any outside post.","When I first received the pair of lights only one worked. I emailed and called CC. To my surprise, I received a new replacement cap in about a week. I had written a negative review earlier because I hadn't heard back from the company. I'm delighted that they sent me a new working light but wish they had communicated their intention better.I apologize for the negative content.I think,the light is OK but it is NOT copper. It is a plastic light painted an antique copper color.","These are just like the name says Classy. Light is soft but enough to see the steps. Great price, I am ordering 2 more for a gate.","I was initially but got over it pretty quickly.Both lights now work fine and look great. We'll see how they stand up to a Minnesota winter.","Ordered 2. 1 stopped working after 2 weeks. The light is extremely dim on that one. Changed batteries. Tried recharging the ones in it. No use. The tops were also \"copper-like\". Meaning plastic colored copper. Too much $$ for what you get.","We really liked the looks of the caps and didn't want to return them. A quick note to Classy Caps elicited a response from Amber to try some other nicad batteries (if we had them) as the batteries could be the problem. We had some AA nicads, installed them and the problems went away. We emailed Amber a second time and asked for 6 replacement batteries.","We ordered two packs (4 caps) for our new deck. Shipping from Canada was expensive but they arrived quickly and looked exactly as pictured. They were well packed, included adequate instructions and were easy to install. We liked the fact there is an 'off' - 'auto' switch instead of the usual 'pull out the plastic tab' method of keeping the batteries from discharging before putting them out in the sun.","Everything is working as expected now and we like the look of our new caps. The reason for 4 instead is at this price point it was disappointing to have to go back to the manufacturer for service on an item that just came out of the box.That being said we wouldn't hesitate to purchase from Classy Caps again, their willingness to troubleshoot the problem and supply the necessary parts to 'make it right' is pretty impressive in this day and age."],[{"answerText":"I love these light caps, I would say though, that the light color is more blue in tone.","answerType":"NA","helpful":[0,0]},{"answerText":"The light given off by my Classy Caps is a cool white color, no yellow tint at all.","answerType":"NA","helpful":[0,0]},{"answerText":"I have four of these on my dock in Central Florida.  You will have dim white light if you get a full day of sunshine.  Mine is neither yellow or blue.  Hope this helps you.","answerType":"NA","helpful":[0,0]},{"answerText":"soft warm white light","answerType":"NA","helpful":[0,0]},{"answerText":"The light is not the piercing white of some LED's.  A warmer white light is how I would describe it.  Certainly not an over powering bright light.","answerType":"NA","helpful":[0,0]},{"answerText":"I purchased a pair of these lights at the end of last summer.  I would describe the color of the lights as a cool color.  It is more blue than yellow.","answerType":"NA","helpful":[0,0]}],1,10],["B000C1UDPO","Beauty","will it brake before it reaches here","yesno",["when i opened up the package. I was really surprised at the way they look. Good size and they look like real cigars. Every last one of them smell really good. My woman tried to eat me alive (smile) You cant go wrong with this product. Thanks again Amazon","well received this and one of the vials was broke and I cannot return it due to amazons policies and box is differant then picturedso now I cannot return or get a refund or exchange as I cannot find anywhere to contact anyone about this. so money down the drain","well I took a gamble by only knowing of one scent and I decided to purchase the gift pack of the 4 different ones....well the gamble paid off and I am a big winner! The other three scents are great too!","two of the tubes do not spray. they all smell nice. just wish they all work. Gave as a gift last night.","tried this on a whim. Very happy with how they smell and the price. will buy this again and got to my house QUICK","this will be a christmas present for my son in law. i can't wait to watch him grab his lighter. lol  my daughter will not let him smoke. when he finds out it is cologne......","this was ordered on accident. I thought thy were real cigars. That was my fault, but the cologn really stinks","this product is great each one smells great my personal favorite is red it has a great smell to it i would recommend this to any one","this cologne smells like ass one really smells like bad BO. and the rest are just bad wouldnt recommend to anyone","thhis cologne  the very next  day and i used it so quick. all the cigar tubes have their own great smell. good cologne and came in incredible time"],[{"answerText":"the item came in a very solid case.andcare was given prior to shipping","answerType":"NA","helpful":[1,1]},{"answerText":"Absolutely NOT! They package it well:)","answerType":"NA","helpful":[1,1]},{"answerText":"Arrived in the same box with other items, and everything arrived intact. Well packed by Amazon.","answerType":"NA","helpful":[1,1]},{"answerText":"No they were in perfect condition when they arrived  they wrap them in a lot of paper and plastic","answerType":"NA","helpful":[1,1]},{"answerText":"The package looked sturdy but one bottle was broken. any idea how to contact seller?","answerType":"NA","helpful":[0,0]}],0,11],["B00H2JQ4WK","Patio_Lawn_and_Garden","Is the shaft adjustable? Wanted to buy this for my son. He is 6'3\" and needs the longer shaft.","descriptive",["Only lengthy use would demonstrate the value (or lack) of such an arrangement.The D handle is adjustable on the shaft,and I found a compromise setting that allowed for some comfort and easy cutting.As with any other power tool I own, I had intended to remove the optimistically named cutting guard -- after the first test run showed that as expected, maneuvering the cutting head on difficult terrain with it in place would be awkward at best, impossible at worst.","The speed of the trimmer is adjustable with a thumb wheel. Slowing it down increases run time, but decreases cutting power. For grass and light stalks, this works well on low. For heavier brush, you will need full power which decreases run time. I easily used the unit for 35 minutes and still had more than half a charge left on it. I would have used it longer, but I had cleared everything I needed to do in that time.4.","And this was with a large handlebar and shoulder strap. The Toro is simply held at the motor control portion of the shaft, and the handle. And I feel it will got old fast.The motor control is just a squeeze grip with a lockout, but instead of a speed control in le lever, there is a small dial that falls under your thumb.","Trimmers are usually described as \"straight shaft\" or \"curved shaft\" so I fail to appreciate this designation.I am no stranger to string trimmers and brush cutting. Every year, right at the beginning of fire season I find it my obligation to cut a clearing around my house that averages a swath 200 feet wide, nearly a  acre.","I will explore modifying the lower handle to address this issue. As far as the operation as a string cutter is concerned, this is equal to my 4-cycle trimmer which I routinely use to attack tall brush and overgrowth.The battery lasted longer than I cared to work so it will be sufficient for my use. I cleared an area of 50' x 70' which included everything from grass to 1\/2 inch diameter soft underbrush.","Again, not a real problem considering this thing looked like it had been out in the yard splattering plant matter all around within the first five minutes of use :)Compared to my gas trimmers, this Toro electric trimmer is an equal. The only single &#34;down-side&#34; I have to report has to do with the length of the shaft below the operator holding point(s). It's too short for a 6 foot tall man wearing rubber boots.","Here is what I liked:1. The unit was very fast to put together. The two pieces of the shaft push together and then a clamp holds it in place. The line guard is held in place with two screws, the handle has a lever wedge design that basically unscrews to install and then you screw the lever back into place. Done! All you need to do then is charge the battery and then push the battery into the unit. The dual line unit is already filled and installed!","Battery charge time, about 2 hours. Time to install the battery (important note, the battery must fully engage and there is an audible click when it is fully seated) about 30 seconds.2. The shaft has a long reach which is perfect for those drainage ditch and hill side situations. The balance is good so there is not a lot of arm strain. This unit does not have a harness, so I would probably not recommend using it for several hours at a time.","I just purchased this trimmer. It is very powerful and knocks down all weeds and grass, and does a great job of edging lawn. The only downsides are that this tool is heavy and the battery does not last very long even when I only have it on the #2 power setting. I was looking to buy a second battery so that I could have a spare for when power runs out, but battery on amazon is $121.00!","Standard deal but Toro should look closer at their internal packaging as it looks like it's intended for &#34;big box&#34; store shelves and not intended for regular mail shipment. A pallet full of Toro boxes on a freight truck gets treated better than a single box on a Fed-X truck. Not Toro or Amazon's fault but this needs to be said."],[{"answerText":"The length of the shaft is not adjustable. The mid grip handle position can be changed for comfort. I liked the power and performance of this unit but it's about a foot shorter than the gas-powered unit I had been using. I'm 6'2\" and the shorter shaft means you have to bend forward with the trimmer...which stresses the back if used for a long period of time.","answerType":"NA","helpful":[1,1]},{"answerText":"The grip handle can be changed , but the shaft length cannot. A taller person would need to cut closer to your body.","answerType":"NA","helpful":[0,0]},{"answerText":"A \"little bit\". I am 6'1\" and I do have to stoop a little with maximum extension. Depending on what power you're using, the battery won't last but 30 to 45 minutes so it's not too hard on the back. This is a good machine in spite of its shortcomings and I have really put it through its paces. We trim under electric fences on the ranch through 18\" tall Bahia grass and it DOES THE JOB !","answerType":"NA","helpful":[0,0]},{"answerText":"The shaft is not adjustable. However the grip handle on the shaft is. I am 5' 10\" and find the shaft length very comfortable.","answerType":"NA","helpful":[0,0]}],1,12],["B00BY87CKI","Toys_and_Games","Does this purchase include the Mars and Ceres Cards?","descriptive",["Also the printing on the gods cards, its a lot for such small font and some of those in my group with visual impairment have issues. Though again, I love this game so I simply typed out the info on the gods cards and printed in larger font so they could reference it in larger print.","This deck building game is a definitely a nice add to the genre. Most games of this genre especially the order ones like Dominion limit the purchasable cards to ten different ones each in their own stack. Kanzume Goddess changes that by dividing all of the purchasable cards into six random stacks.","I have yet to play a multiplayer game, but as a 2 player game it was incredibly simple and fun. I did take the time to put all the cards into sleeves as there is a lot of shuffling (between setup and personal draw pile cycling) and wanted to keep the cards as beautiful as they are. The tin canister is also a nice touch. It is refreshing to see packaging that isn't just a box.","The game ends when a player reaches zero health.Great fun, and much more interactive than Dominion.My only negative was the text on the cards. I have good vision and I still found that I needed a magnifying glass in order to read the cards. From what I can tell these are printed in 5 point font. Once you get to know the cards, it isn't as important, but for a first time player I'm sure there will be a bit of \"what does this card do?\"","This game is a favorite in my group of friends and would highly recommend it to someone trying to learn deck building games. The main issue me and my friends have found is that a lot of rules are sometimes vague and you need to figure out what would happen in certain scenarios. The art on the card is typically women who are wearing very showy clothing, so if you would play with someone who is opposed to that I would recommend a different deck builder.","Overall I would recommend this game and hope they are planning more expansions.","It was a great fun PvP game. I have not done the team format yet, but I think that would be the funnest way to play it. Rules are simple, the game can go fast, and the artwork is beautiful. If you are a fan of deck building games, or quick PvP games this is for you.","It takes a minute or two to go through the instructions and learn some of the terms (some are not described in the rules but in a glossary instead), but once you play through the game picks up speed and becomes fast and fun. There are definitely some of the Gods and Goddesses that play better than others, sometimes creating a larger \"advantage\" against your opponent.","I played this game at the recent Gen Con gaming convention. It plays like most deck builder games where you start with a base deck and your job is to use the powers of your disciples to acquire the powers of the celstial warriors and defeat your opponent. There is quite a bit of strategy and luck as you work to defeat your fellow gods and to be the last one standing.","I love this game!! I feel it's pretty simple to understand for anyone who has played other deckbuilding card games. And the artwork is gorgeous. There is an extra element in this one though where you get to play a Greek or Norse god\/goddess and battle against the other's in the game, so it's not a simple &#34;whoever gets most victory points or such wins&#34;. And you can also play in teams where one side is Greek vs other side, obviously Norse."],[{"answerText":"Yes, it comes with both Mars and Ceres cards, mine did anyway. Hope this helps.","answerType":"NA","helpful":[0,0]},{"answerText":"Mine did not come with those promo cards","answerType":"NA","helpful":[0,0]},{"answerText":"Unforchenly they don't come with the game. They were kickstarter promos.","answerType":"NA","helpful":[0,0]},{"answerText":"It does not include those cards.  Maybe in an expansion.  Not sure if you've bought the game yet or not.  In my opinion, as a deck-builder, there are games that are way  more fun out there.  The cards however are beautiful and unique.  Hence, I'm breaking these sets down and selling the cards only as collectibles online at www.nuckelheads-toys-and-games.com.  They should be listed shortly.  I hope that answers your question.","answerType":"NA","helpful":[0,0]},{"answerText":"Nope, not in my can. Might be promotional","answerType":"NA","helpful":[0,0]}],0,13],["B009XER99Y","Cell_Phones_and_Accessories","How do i charge this headset, is wall charger included, if not then how do i charge it, and does charging work in other countries but USA","yesno",["This is my second bluetooth headset and it is considerably better than the more expensive one i purchased. I don't have much to compare it to but i am very satisfied.","This Bluetooth headset is really a great deal! I was looking for a Bluetooth headset, and I did not want a cheap one, so fortunately, I found a expensive one for a cheap price.","My Motorola H870 would not work with my new Galaxy so this was a godsend- no more wired handsfree. It paired easily and sound quality is great. My parents could not tell I was on a bluetooth, and I can hear clearly.","This works ok. If I'm talking to a landline it works fine. If I speaking to someone on another cell phone it breaks up. I have it paired with a Samsung Galaxy S3 and it doesn't read out texts or send notification sounds through the headset.For the price I paid its good enough.","I first bought one of these last Christmas to replace my wife's Motorola Oasis that had started misbehaving. Later I bought one for myself after my Samsung WEP460 got broken. These units work great. Nothing fancy, just the basics, but the performance is excellent with great range and extremely long battery life. I only recharge about every other week (although I am admittedly not a heavy cellphone user). My only complaint is that the ear hook is not the most comfortable for me, although my wife has no complaints.","the box was a disaster, but the bluetooth was ok, for a good product","i find this too quiet to use. even when i'm at home. if i am doing chores at home, those sounds might cover up the voice on the ear piece. i definitely can't use this in the car (my car is louder than the average car).i don't understand these ear buds that simply sit &#34;on&#34; your ear. I miss the old plantronics discovery that had the ear bud plastic that would go into your ear. the sound on that was great.","i don't know if &#34;on&#34; your ear is a good description for this, but if you get one, you'll see what i'm talking about.","Works great, although the rubber ear pieces fall off... Then i lose them. This is a sad experience when it happens.","Very good for the price, but volume and fit are not excellent; does a nice job pairing with my phone and has been durable; battery life is amazing!"],[{"answerText":"The wall charger is included. If it's used and doesn't come with the charger, any micro USB charger will work. Takes the same charger as almost all smart phones.","answerType":"NA","helpful":[0,0]},{"answerText":"Yes a wall charger is included. It works in USA.","answerType":"Y","helpful":[0,0]},{"answerText":"A wall charger is included, but you can also use the standard android charger with the headset.","answerType":"NA","helpful":[0,0]},{"answerText":"The wall charger is included and it is universal so yes it does work in other countries. There is a latch in the back of the headset in which you can use the tip of your nail to open.","answerType":"Y","helpful":[0,0]}],0,14],["B001ECQ49Y","Patio_Lawn_and_Garden","Is the BV 5600 which supersedes this model just as popular - I understand the bag is discontinued on original (LH4500) why - please?","descriptive",["I own the original model of the Leaf Hog which has performed well for 5+ yrs.with the original shoulder bag and BV006 adapter tube and collar for a trash can. With a quarter acre of leaves I wanted a second so that spouse and maybe even son could help reduce the work load. The LH4500 is more robust than the original and with a metal rather than plastic impeller does a better job of shredding. It's well balanced and easy to manipulate.","The Black&Decker LH4500 12 amp 2-speed Electric Leaf blower\/vacuum works great. I looked at several brands and read tons of reviews before deciding on this particular model. It can blow the leaves or vacuum and shred them into an attached bag. The power is sufficient and it isn't overly loud. I definitely recommend this model. It gets the job done and is very reasonably priced.","We had a B&D blower for some years but recently it broke (no fault of its own). We replaced with the highest rated Toro. Did not like it. While it blew OK, it sucked at sucking. After using it for a weekend, I sent it back for this Black & Decker. It is better than our original. Metalic impeller and design of air flow is superior. This model blows well and sucks\/mulches well, too. Recommend it.","If the shoulder strap wears on you, take an old face cloth and wrap it around the strap where it rests on the shoulder. We hope that the LH4500 serves as well as the original Leaf Hog. With a 2 yr. warranty, B&D offers a good product.","Used this twice and let me tell you this thing is strong and tough. I never got my leaves done so fast and it handles wet leaves with out a problem. Chops up small twigs too. This is by far well worth the purchase. I bought the Toro 43 gallon collapsable bin which works great. I also bought the BV-006 attachment for this but it does not fit it. I contacted B&D and they are shipping an attachment for the LH4500 to me asap.","I tried to find an adapter that is \"supposed\" to exist, but the B&D; customer service site has no adapter shown. I contacted B&D; several times to get an adapter to hook-up my older BV-006 Trash Can Collector tube and the new LH4500, but after several email exchanges, I never did get the adapter I needed, so I just modified the old BV-006 end-fitting to attach to the new LH4500.","I replaced an earlier version of the B&D leaf vac\/blower with the LH4500. METAL BLADES chop the leaves. The improvement in this model is great.","I purchased the latest LH4500 after my older Leaf Hog broke (motor gave out), with the hope that the newer model would perform even better.","Five years with an earlier model led me to this LH4500. I wore the other one out from constant and slightly rough usage.The blower is very powerful and easily maneuverable. The two level switch is in a convenient position. The suction power on leavesis awesome, and I expect it is durable enough to survive for a reasonable number of years.","The bag will fill up within 3minutes if you have a big pile of leaves. However this year I did purchase the B&D; collection attachmentBlack & Decker BV-006 Blower\/Vacuum Leaf Collection Systemand it has made life a lot better. I would highly suggest using both."],[{"answerText":"We like the 4500 series because it has a metal propeller compared to the plastic one on the 5600. We dont use the bag, we use a trash can with the adapter with a 4 inch hose.","answerType":"NA","helpful":[1,1]},{"answerText":"The LH4500 is very loud when blowing.  It still comes with the bag.  I would advise the less noisy BV5600.","answerType":"NA","helpful":[2,2]}],1,15],["B003W125RA","Electronics","Is this a \"rapid charge\" cable?","descriptive",["i always need cables. unfortunately, this one is not a rapid charger... i used to use it in my car,,, but it would take 8 hours to charge my phone with this..... but taking it in the house it died quite suddenly when my dog ate it. so sad","An extra USB is definitively a must have as quickly as these cords deteriorate! I would recommend purchasing the Motorola SJ1444A Rapid Rate Dual Port Car Charger as well.","This product works perfectly with my Droid Incredible 2. I get a very fast charge with this cable as well.","I needed a cable to bring in so i could charge my phone at work and this was a cheap and reliable option, works great and charges fast","Finally, a cable that works! I have purchased two cables before this so that I can charge my Droid Razr in my car. This is the first cable that actually worked!","A basic good quality cable to charge my phone. The best quality is it's length. I can charge my phone in bed without leaning off the bed to use it.","bought this cable to charge up my Droid X (1st gen) at my desk and the cable does exactly what it is supposed to do. it works as well as the one that my phone came with, no problems with it whatsoever. you won't be disappointed.","I actually ordered a few of these, one for use at my office desktop and a few to give to co workers so they would stop stealing mine to charge their phones. Well built, reliable cable. Highly recommended.","I got this cable to attach to my Atrix (1st generation) for charging at work. The first one the pins were bent and wouldn't go in the phone.I contacted the seller and they sent out a replacement that works great!Now I can charge my phone at work through my computer.","I needed a second charging cable for my phone when I realized I could charge my phone on an open USB port on my HDTV. I have the original that came with my phone in my car and it charges quickly so I purchased this one as well. It does what it needs to do."],[{"answerText":"It is not.","answerType":"NA","helpful":[0,0]},{"answerText":"No, it is quite the opposite, actually. It takes an extremely long time to charge my Galaxy S4.","answerType":"NA","helpful":[0,0]}],1,16],["B00133RCCC","Electronics","Will I need any other harness to install an aftermarket unit or is this both a harness and adapter? I have a 2006 Toyota Sequoia SR5 w\/ JBL amp","descriptive",["I have an 05 Toyota Sequoia with the JBL system. I wanted to keep my factory system that has an amp but put in an aftermarket head unit. This worked great. A wire pulled out of one of the harnesses but Amazon sent me a replacement the next day. Works great and very easy install.There are only 4 RCA plugs to plug into the back of your aftermarket head unit and then you just connect the power, ground, amp (accessory), and constant power.","The JBL Synthesis system in Toyotas is quite good for a stock system and with 10 speakers and subwoofer, the sound is excellent. In order to keep the sound quality when replacing the head unit, you need this harness. It connects to the harness from the aftermarket stereo and then connects to the factory harness that leads to the amp. The amp powers all speakers in the system, so if you don't have this harness, you get no sound at all.","This harness is very easy to use. The simple instructions make it a breeze to connect to aftermarket stereo. Thank you for allowing the feasibility of retaining stock amp\/speakers in 2006 Toyota Tundra.","doing my dear ole dads radio install n i think he might have a jbl amp \/system just wondering if there were any toyota rav 4 installs using this harness again for a 2006 toyota 2.4L rav 4 thanks","Installed an aftermarket Chinese HU (Eonon d5125) in my 2006 tundra dc JBL. The HU actually works OK, software is a little lame.I tried both the Metra TYTO-01 and the PAC TATO unit. I ended up using the METRA. Sound quality from both adapters was  just so-so. A sound downgrade compared to factory setup, but tolerable for me.","It is very simple to connect my 06 Toyota Sienna XLE (JBL Premium) factory harness to my new Pioneer AVIC-z140BH with Metra TYTO-01. The only thing I don't like about this harness is that it does not have connections for three wires on my Pioneer HU: Parking break (green), speed sensor (pink) and reverse (violet\/white). You need to figure it out by yourself. My OEM harness do have all these connections!","A simple install and I finally have an aftermarket stereo in my 2005 Toyota replacing the terribly outdated JBL cassette player.It took all of 5 minutes to install in my Tundra DC ...and about 3 hours to figure out my truck doesn't have an ordinary \"illumination\" dimming wire\/system.This is an expensive part, for me it was worth it.","I have a 2002 IS300 with the standard premium 6 disc radio unit. Could not find anywhere on the amp or unit that said JBL. The harness worked perfectly except for some minor background hissing noise. It kind of sounds like the sound old cassettes made. I recommend this harness over rewiring the speakers.","I wanted to continue using the Lexus factory speakers, amp and subwoofer in my wife's 2002 Lexus ES300, but needed to change the head unit to gain iPod, USB, BlueTooth and HD Radio capability. So I purchased a Metra TYTO-01 JBL Amplifier Interface Harness which includes a small box containing active circuitry to handle the stock amplifier turn-on.","I bought this adapter for my wife's 06 Toyota sequia with a new aftermarket radio. It works perfect and i really like the boost adjustment. The converter box is somewhat big at about 2.5 x 2.5 x 1. So make sure you have room for it behind the dash."],[{"answerText":"If it a jbl set up thats all you are going to need","answerType":"NA","helpful":[0,0]},{"answerText":"No. You only need this one. It wires to your aftermarket stereo.","answerType":"NA","helpful":[0,0]},{"answerText":"No you don't, Every thing you get with the TYTO_01 IS all you need.","answerType":"NA","helpful":[0,0]},{"answerText":"Hi We thank you for your question and this is all you will need. Thank you","answerType":"NA","helpful":[0,0]}],1,17],["B001IWMP1G","Home_and_Kitchen","Are these mugs lead-free?","descriptive",["Very happy with these heavy duty mugs. Big enough to heat soup in.We are avoiding any dishware with a glaze (lead) and these are perfect.","These mug are okay, but nothing special. I'm not crazy about the feel in my hand, but I am picky about that.The positives are that they are not made in China, they are made of glass so there is no risk of lead in glazes, and they wash well.","These mugs not only hold a fantastic volume of coffee or tea but are beautiful to look at & microvave friendly. I was looking for these because I don't want to heat in plastic due to leaching of chemicals even if they are BPA free. So far no problems with chipping or breakage. also like the smooth simplistic design that's absolutely easy to clean.","Nice mugs - good quality - love the size and weight.","Got these for my aunt who like to drink her coffee out of glass mugs. she loved them!","I really like these Libbey mugs! You can throw them in the dishwasher and they don't collect water on the bottom!","I love the mugs that I ordered. I haven't seen any like them in stores and really like them!","Just what I was looking for. Very heavy, quality mugs. Even dropped one and it didn't break. I recommend these mugs.","I simply love these mugs. They are very beautiful and also my boyfriend's favourite. These mugs are elegant to have on your table. Perfect.","I drink my green tea in these mugs. They give off a serene, peaceful glow as they sit on my desk--very enticing."],[{"answerText":"Yes they are lead free... Enjoy!","answerType":"NA","helpful":[0,0]},{"answerText":"yes they are lead free as far as i know.","answerType":"NA","helpful":[0,0]}],1,18],["B00DS842HS","Grocery_and_Gourmet_Food","Is this non-hydrogenated?","descriptive",["I've been a coconut oil user for a couple years now after reading about how all other oils break down in to unhealthy oils (transfats, hydrogenated, etc) and the health problems associated with them. I prefer organic and non-GMO because I don't want a healthy oil that is saturated in pesticides or one that is genetically altered with very little research to justify calling it a safe process.","If you have not yet tried coconut oil in your baking, dont be put off by the thought of &#34;coconut&#34;.Out of the jar the coconut oil has the consistency of a product like crisco but with no flavor. You can melt in quickly in the microwave and use it in place of most any recipe that calls for vegetable oil.Unlike most vegetable oils, Viva Labs Organic Extra Virgin Coconut Oil is not hydrogenated.","I'm sure it has the benefits but the actually flavor of coconut did not come through in my 20 ounce of smoothie - perhaps it was too much strawberry masking it.I've used coconut for cooking and that worked well - and in place of crisco - which is partially hydrogenated oils (aka uber bad for your health).Lastly, I tested it as a moisturizer. This coconut oil takes a while to massage in and will feel freezing (it's unprocessed oil afterall) but does absorb well.","I grew up thinking coconut oil was bad for you, like hydrogenated vegetable oils. I'm sure glad the truth is out, and that my family and I can now enjoy the extraordinarily positive health benefits of coconut oil. I've tried several brands, and this Viva Labs was excellent, and at a very reasonable price point too. Of course it meets all the check points for being created the right way, things like cold pressed, not heated to high temps, organic, virgin, and so on.","this product is very nice , I have used as a moisturizer , toothpaste , it is mild and non greasy ..I will but it again","Smells good and is organic. I use it on my hair and skin. It fully absorbs and is non greasy.","This coconut oil is way different than the non organic you buy at the grocery store. It really has a coconut flavor. Great on anytbing.","It's also a Non-GMO verified product which was  very nice to see on the label.This is great oil for popping popcorn, adding to smoothies, or making chocolate.","A friend suggested I use a good non refined organic coconut oil as a natural lubricant while pumping. This product has been working great!","I love this product and use it to assist my non functioning thyroid. I use it to cook, as a natural lotion for my skin, and it is the only thing I use in my hair."],[{"answerText":"The labeling on the container shows that it is USDA Organic. Which by law it has to be non-hydrogenated in order to have the label. It is also certified gluten free by GFCO. Non GMO, free of pesticides,bleach,hexane even the container is BPA free. Also it is a product of the Philippines.","answerType":"NA","helpful":[13,16]},{"answerText":"Hi Min7, Coconut oil is naturally a hydrogenated fat so it does not need to go through a hydrogenation process. This is what makes it stable! Hope this helps answer your question, and if you have any other questions you can reach us by responding to this comment thread or by email at amazon@vivalabs.com.","answerType":"NA","helpful":[8,9]}],1,19],["B005WEE0ZU","Cell_Phones_and_Accessories","does this work for I phone 4 G?","yesno",["Great product, highly appreciated, a must have for professionals who need fast access to their phone. very comfortable adjustable settings for various heights. I am a doctor and it comes handy for my work. God bless you.","My wife is happy so the house is happy too!! She uses it for work and when driving to keep up with work.","The lanyard has a quick release, break away clasp, which though potentially helpful, is irritating to my neck (thus the 4 star instead of 5 star rating), so I have wrapped moleskin around that section, which makes it perfect.","I purchased this for my elderly mother who lives alone. Now she always has her phone handy in case of an emergency. Great product.","Exactly what I needed to keep from forgetting where I left my cell phone. Light weight and easy on the neck.","This is handy and works great for &#34;hands-free&#34; - can bring the phone with me as I move from room to room with our infant. :)","Worth every penny! I use to have a lanyard that inserted in the charging port, but the phone kept slipping off. This lanyard\/case is very secure!","Best phone accessory I own. Wish more accessory makers would get smart and make similar items. Great for seniors like me.","I started a walking plan around my neighborhood but did not always have a pocket for my cell phone. This adjustable strap allows me to have access to my phone and music. Love it.","if Verizon (where I purchased my phone) had carried\/offered this product. I had searched for something like the \"necklace \" for over a year...then a very SMART friend googled \"i phone necklace \"."],[{"answerText":"It worked for our Iphone 4. I do not know what the G is for.","answerType":"NA","helpful":[0,0]},{"answerText":"I hd originally bought this for the IPhone 4 and it worked perfectly","answerType":"NA","helpful":[0,0]},{"answerText":"It works with my IPhone 4s and the Amazon site says it works for both 4 and 4s devices.  It is a neat item and very convenient for keeping your phone close with little fussing about... I've had many people comment on it and ask where I bought it.","answerType":"NA","helpful":[0,0]},{"answerText":"I use it for my iPhone 4S. I have had it for quite a while and it is holding up well.","answerType":"NA","helpful":[0,0]}],1,20],["B00AU5BM6G","Sports_and_Outdoors","is this bag compatable with zipping up and attatching to a second one?","yesno",["I chose this product for it's temp. rating, which I used the second night in approx. 37 degrees and was quite warm. I also liked the overall weight and size of sleeping bag in it's storage bag. The down sides for me are I had some aggravation from the zipper catching the fabric when closing, the zipper is located on the wrong side for me, and I wished I had ordered a slightly wider sleeping bag.","Zipper does not stay shut. Used it camping and the side zipper kept opening all night not to mention it kept getting caught when you tried to zip it shut. Worst sleeping bag ever!!! !","The bag is comfortable and easy to pack. Extremely compact. There were other kids at the camp and they were lugging something as big as a carry-on. the carrying case has little of extra room that fits a Kelty single color camp pillow perfectly.","really liking this sleeping bag. i opened it when i got it and the inside is a really soft plush material.. seems to be waterprrof? or resistand at least. don't know what else to say other than nice bag. o im 5'6'' 130 pounds and i have a llittle room  so it could fit quite a bit bigger of person than me..","Kept me warm and snug during the cold evening, the carrying case is easy and functional. So far it has met my expectations.","It is beautiful and warm enough, packaged very well. I have not used it for camping yet, just used it when goes to friends home and there is no bed ^^ It has been comfortable :)","I used this during the summer and it was fine but when it rained or was a chilly night, I awoke from the cold. Not ideal for hiking. Also, I thought the hood would somewhat cover my head but it is more like a small lip and doesn't provide the extra warmth or eye cover I was hoping for. The compression sack doesn't shrink it down much for backpack use.","I like the quality and comforts , + I comes with the good quality case, and you and fully open it and use as a sheet","Barely large enough for my girth, but a good value. Quality is acceptable, would be better if 2 would zip together."],[{"answerText":"Yes, they are small though and quite a snug fit..","answerType":"Y","helpful":[0,0]},{"answerText":"No, I don't believe so. But very warm and comfortable as a single. Room for two smaller people, being 55\" wide. I think a second single would be a better bet lay one on surface and one over same idea only not zipped together would still be cozy  and warm. Hope that helps!! :)","answerType":"N","helpful":[0,1]}],1,21],["B008IGTMXY","Baby","If your child turns this upside down and pushes the straw part into the floor or shakes it upside down, does anything come out? Thank you.","yesno",["Love this cup.. Easy to use and durable. My baby has dropped it a couple of times on our tiled floor and never broke. I had to get used to knowing how much pressure to use twisting it open and twisting to get the straw out the first time but after that it's so easy..","It's a pretty good straw cup but occasionally it will leak, the liquid will come up the straw by itself. I found that opening the cup helps with this issue. Also separating the cover that spins and protects the straw and the lid is challenging at times. Overall it's fairly easy to clean.","these straw cups are awesome, very easy to use with a rotator cap to close the straw, very happy with this purchase.","Our little one loves to drink from this cup... Its relatively easy to take apart compared to the other straw cups that we tried.","My kid was drinking to quickly and spitting out water all over the place. The straw is slower flow so she doesn't take in as much and has learned how to drink properly from a straw cup.","My daughter and even all her playdates find this bottle to be easy to use. My friends daughters liked it so much that her mom had to swap her other straw bottles for this one.","Very happy that avent came out with a straw cup as my baby do not like the zippy cup. The only complaint that I have is that the parts are difficult at times to take apart for cleaning. If it wasn't so complicated, it'd be a great product!","I need to get the straw cover out to open the lid.Overall, it's an okay cup. I would have felt better if I had gotten the 9 oz cups that I had actually ordered.","Daughter enjoyed the cup a lot and was able to suck from straw almost right away. Like the fact that it is design so that baby do not need to really use a lot more effort to get to liquid like other cups we bought previously.","I am so excited to have found these cups! They have a really great design, they are easy for my daughter to hold and best of all the DON'T leak!!! We were previously using the playtex insulator straw cups but these are much better. They aren't insulated, so her water doesn't stay as cold while we are outside but I'm okay with that. We will definitely be buying more of these."],[{"answerText":"Nothing comes out if the child turns it upside down and shakes it. The only problem we've had with it is that liquid just comes up and out when it's closed tightly. Pressure issues? Other than that it's a great soppy cup and I can just give baby the cup without worrying about her spilling everywhere.","answerType":"Y","helpful":[0,0]},{"answerText":"Yes it does come out..","answerType":"Y","helpful":[0,0]},{"answerText":"Yes sometimes it comes out.","answerType":"Y","helpful":[0,0]}],0,22],["B00115R6GO","Home_and_Kitchen","May I replace model no. p-165bn with the cartridge ?","descriptive",["It was a very good price for the filters. They came in on time as requested. The part I like best about the filter is when it's full it shuts off automatically so you know when to replace it.","This is a boring review. It is a replacement cartridge. As a system it works. Changing the filter is not obvious, so you have to read the directions. Mine is buried under the sink so it is awkward to change, but since it lasts for years it is not so bad to have pure water.I ignored the use dial, so it literally started to slow down the water flow until I paid attention. Now it comes with an electronic indicator.","12 years using this water filtering system and not plan to change it. Great system, well manufactured, well packaged but maybe over priced the cartridge units.","Excellent under the counter system. No fuss installation and replacement. In use since more than a year. Predecessor filtration system was an older model of the same family that lasted many years","Easy to install and does everything it is advertised to do. I would give it 5  stars if it were less expensive","This is a replacement item, therefore not comment is needed. I am completely satisfied. This survey is not meeting your needs or mine.","The product was delivered on time and in perfect condition. I really don't know what else there is to say. I bought it, I used it and it works.","Love this water filter. They aren't cheap but the quality of the water is much improved. I have used the filter for the last three years. Replacement is fairly easy.","The above title says it all. I live in a town with water made clean by virtue of various additives--the main one of which one can easily detect. Since water is about all we drink, having filtered water allows us to have delicious water without having to use a Brita--a far more expensive alternative.","as title. it's not good as before. and it charged too much here. the custom didn't charge it but the custom's fee didn't returned."],[{"answerText":"No,they are not match.","answerType":"NA","helpful":[1,1]},{"answerText":"I suggest you call Aqua-Pure with your question.  They are very accessible.","answerType":"NA","helpful":[1,1]},{"answerText":"I don't think Amazon carries the filter you need.  Try contacting:  Aqua Pure Water Conditioning directly10525 Enterprise DrDavisburg, MI 48350Phone: 248.620.6055Toll Free [877.633.3928]:  Looks like they charge P165BN     $128.99P165BN Replacement Filter Cartridge for SGP165BN-T system-56176-01; capacity is 719 gal (2,722 lit) at 9.0 gpg hardness; Flow rate is 1 gpm (3.8 lpm).","answerType":"NA","helpful":[0,0]}],1,23],["B003D7E2XI","Baby","Hello I bought this snoogle pregnancy pillow and love it. But can it also be used as a feeding pillow?","descriptive",["My Mom bought me a snoogle for my first pregnancy and I LOVED it. My husband however complains that it takes up too much of the bed as it can creep past the middle into his territory. He put it in storage before I even came home from the hospital with our daughter. I have it back out to use again as I am expecting again. I love my snoogle!","I am 6mos pregnant and thought I was getting by just fine with my own pillows and a body pillow. WRONG. My husband bought this for me for Christmas and I've never slept better. It's amazing. I'm glad he didn't listen to me when I said I didn't need an expensive pillow when we have so many others on our bed. Also, I'm 5'10&#34; and it fully supports by back and belly at the same time. Love it!","I bought the snoogle at around 14 weeks when my back and hips started making sleeping a bit uncomfortable. Now (at 20 weeks) I don't know how I'd be sleeping without it. It is so comfortable. Besides sleeping (which I use it in both positions- as I flip over in the middle of the night) I use this while watching TV, working from home, etc. and it's a great prop up pillow. I also like the fact that I can use it while nursing.","So comfortable!Had I known about this pillow I would've bought it before my pregnancy! I love its versatility and support. I slept","I bought this pillow because I'm a back sleeper and wanted something to help me stay on my side during pregnancy. The pillow arrived during my 17th week of pregnancy. Initial thought -- heaven.I've had the pillow for eight weeks now.PROS:Love the soft cover.","Love, Love, Love Snoogles. I bought 1 for my husband years ago, no he is not pregnant, he just loves pillows. I got tired of picking up pillows every morning so the Snoogle replaced about five of them. Then for Christmas a couple of years later he purchased one for me because I had begun sort of sharing his which he wasn't to fond of. He didn't spend the extra money for the jersey cover on mine and I wish he had.","This was a gift for my daughter in law and it was a hit with the whole family!! She said it is great for her to sleep or rest if she can get it away from my son and her young daughter - great gift!! I think it will be used after the pregnancy also! !","The snoogle is definitely one of the best pregnancy purchases I have made (if not the best). If I am ever sleeping away from home, I always make sure to bring this because I don't want to know what a night without this would be like. I bought this at about 14 weeks and am now at 24 weeks. It has gotten a little flatter near the head, but I can always add an extra pillow. The rest of the pillow has maintained its shape.","So nice, big, cuddly and soft, I used all during my pregnancy and even after. I absolutely Love iT!!!! =)","I'm in my third tri with my second baby, and I love this pillow. I wish i had it with my first pregnancy because it makes sleeping a LOT easier.One of the things i love about this pillow is the variety of ways you can use it. Sometimes i use it for my head, sometimes i just flip the top to the side, use my own pillow for my head and use the rest of the snoogle for my back and between my legs."],[{"answerText":"Hi, it is a bit too big to use as a feeding pillow. However,  if you position it right in a spacious area you can use for feeding,  I can be useful.  Thanks!","answerType":"NA","helpful":[1,1]},{"answerText":"I believe so.  You can wrap it around your belly and it gets higher and higher, and probably high enough to support your baby.  By the way, I am not pregnant or the mother of a small child, but I do teach childbirth preparation and host a new mom's group.  I deal with breastfeeding issues all the time and I think this would make a wonderful feeding pillow.  If you still have the card that came with the pillow, they give you different ideas on how to use the pillow.  Give it a try!  And good luck!","answerType":"NA","helpful":[1,1]},{"answerText":"I think you can, just have to prop it in certain way.","answerType":"NA","helpful":[0,0]},{"answerText":"I thought it was perfect for night feedings. My baby slept in a co-sleeper next to the bed, and I would just sit up, wrap the Snoogle around me, feed, then get right back to sleep. It was perfect to offer support for the baby, and also my back while I sat up. It's a little too much to deal with for day feedings though, a Boppy was better for that.","answerType":"NA","helpful":[0,0]}],1,24],["B00AKGH3AO","Tools_and_Home_Improvement","Standard base bulb or candelabra base bulb?","descriptive",["My wife wanted to add some bling to her walk in. We have bronze throughout our home, so I found this after a chandelier she found at Ikea proved too long. I like this because it was easy to shorten enough to fit in an 8' tall closet without me hitting my 6' tall head on it. It looks very nice and wasn't difficult to install. We paired this with a Sylvania 78911 14-Watt A19 Ultra LED Bulb and it provides great light at a low cost.","Nice mini chandelier. It looks okay in the box, but amazing after being assembled and installed. I put it in a small bathroom next to my foyer and have received a lot of compliments. It came with small additional  pieces in case the regular ones are broken or missing and I'd say that it's a good size for an small bathroom or room","It was a PERFECT buy!","I have a small dining area yet wanted it appealing and a bit elegant, but not too! My dining room would not handle a large, gaudy chandelier. I hunted for something with \"bling\" appeal, but not glittery tacky. I picked the absolute PERFECT item to fulfill those needs. This chandelier is on the smaller side and has real sparkling and beautiful crystals. You need to hang the crystals yourself, but it is easy and they even send extra crystals if there is a chipped or broken one."],[{"answerText":"it takes a standard bulb.","answerType":"NA","helpful":[1,1]},{"answerText":"uses one bulb.  I have a regular small (short), but not the candelabra type.  but you can use any type","answerType":"NA","helpful":[1,1]},{"answerText":"This fixture takes a 60 Watt A19 bulb.  An A19 bulb has a medium base.","answerType":"NA","helpful":[1,1]},{"answerText":"Standard bulb","answerType":"NA","helpful":[1,1]},{"answerText":"will take both, however I use standard base bulb","answerType":"NA","helpful":[0,0]},{"answerText":"It fits with an A19 led bulb with a standard base. What I use for this fixture is a 60W equivalent from traditional incandescents but only consumes 9 watts. You can check it out here: Triangle Bulbs T95121-6 (6 pack) - LED Dimmable 60 Watt Equivalent Warm White A19 Light Bulbs, 6 pack","answerType":"NA","helpful":[0,0]}],0,25],["B003ZU0BYM","Pet_Supplies","will it work on artificial grass?","yesno",["If you suffer from odors around the house due to animal mishaps I highly recommend this item. It works very good. Especially on urine. If you use it as directed it will work. the price is right and the smell goes away. I highly recommend this item.","I originally reviewed this item in June 2012, and was not happy with the product. I found that my house smelled of dog urine for days after use and was very upset about it and thought it didnt work. Well the smell eventually went away and after that I forgot about the product and what I had done.","It seems to work as advertised, in that when we use it pet odors seem to be gone. It is very inexpensive compared to the pre-mix stuff we get in the store. I only wish it had a longer life once mixed up because we like to keep some odor stuff in a spray bottle for puppy mistakes and making a batch for a small spot is overkill.","This stuff works great, and the price can't be beat considering it can make several gallons.You need to know, for it to work you really have to soak the stain. The product has to come in direct contact with all of the smell for it to do it's job. Soak well, let it sit for at least 30 minutes and then soak it up well. Repeat if the smell still lingers when mostly dry (it usually doesn't).","For monthly cleaning, I put a tablespoon in the soapy water canister of my Bissel carpet shampooer every time and it works AMAZINGLY.Besides working really well (a BIG thing to me) and being economical (EVEN BETTER! ), this product is exceedingly safe for animals and humans alike. I have used my hands to work the liquid into the carpet and there is no itching, no bothering my very sensitive skin.","I saw all the great recommendations and used this. It's no-nonsense, lasts forever, and leaves ABSOLUTELY NO SMELL on my carpets. NONE. Your carpets will smell like pee still while they are drying, but once they are done drying, it is absolutely amazing how there is NO smell. I mix up a tablespoon in a kitchen mixing bowl with very warm\/hot water and really dump it into the carpet and work it around (SOAK IT!)","Worked pretty well outside where our pet uses the bathroom. However in the bedroom where she accidentally urinated on the carpet and we didnt catch it in time, it didnt seem to completely work. Seemed to mask the smell in the air but if you get near the spot on the carpet you can still smell a strong odor of urine. And believe me I have tried everything on that spot! If it wasn't brand new carpet we would have already ripped it out.","The carpet was just damp at this point.I put in a large fan and started drying the carpet. It has been three days, the carpet is completely dry and it smells worse than it ever has.I really wanted this to work so I mixed a greater ratio of the powder to water than  is even required per the manufacturers website [...] . They say 1 tablespoon per gallon and I mixed closer to 2 tablespoons per gallon.","Odormute works on very difficult odors--like cat urine in thick carpet. I tried dozens of products that said they would work and didn't until I found Odormute. You need a *little* bit of patience because it doesn't work until it drys. Another slight disadvantage is that you can't keep it ready: you only mix up the amount you will use right away. But all that pales before a product that actually completely eliminates the odor, even to my sensitive nose.","Anything from 45 to 140 degrees F will work, but anything over 140 will kill them and it won't work (so don't use boiling water!). Solution should be used within 4 hours for best results.I should note, I use it at about twice the strength recommended in the instructions to make it work faster, and just because I want to be absolutely sure the smells are gone the first time around. Probably works fine at the label rate, but I've just always doubled it."],[{"answerText":"Sorry, can't answer that question.  I haven't used it yet, I bought it to have on hand in case my kitty ever got sprayed by a skunk.  The literature in the box states multiple uses, including...carpets, rugs, fabric, clothing, furniture, mattresses, kennels & runs, garbage cans, diaper pails, cages, etc.  Also states non-caustic so I wouldn't think that it would do damage, maybe test it on a small area first.","answerType":"NA","helpful":[0,0]},{"answerText":"If artificial grass is plastic, especially if it isn't real porous, then it should work (if you are using it for an organic stain). It works great on removing smell and stain from carpet.","answerType":"NA","helpful":[0,0]}],0,26],["B002NN5F16","Sports_and_Outdoors","Is this for 1 pedal or a set of 2?","descriptive",["I've ordered 3 sets of these pedals and returned 2 sets because of poor bearings and general poor assembly. Of the 3 sets, I did manage to find one set to use and so far I'm happy with them. Float is adjustable so you can loosen up or tighten as needed for the right pedal connection. Love the red\/black style that goes great with the Pearl Izumi X-Alp Seek IV shoe.","It's  a good idea to have an intermediary pedal you can use with normal shoes sometimes. For me, making 2 modifications to make the pedals work right doesn't justify the $10 savings over other pedals. I would suggest taking your shoe to a shop and testing it with different pedals","left pedal developed a bad bearing 2 weeks after use. outer construction is fairly durable altho rust spots developed after 3 weeks from riding thru a puddle or 2.I'd avoid it and go with a better product.the manufacturer will not replace them as there seems to be no warranty","I've had these pedals on my bike for about 2 weeks now and I must say they are a great pedal for the money! I haven't had any issues with pedals as of yet, like others may have mentioned as far as technical issues. I would recommend these pedals if you want a solid pedal for off-road riding and street riding.","I went to a shop to have these put on because I don't not have a pedal wrench and my old pedals were on there pretty good - the guy at the shop said &#34;Where did you get these? I would never put these on my bike.&#34; I did not listen and on my 1 mile bike home there was a noticeable difference from my very old clipless pedals to these brand new and very tight pedals.","this isn't a problem for a commuter\/road bike set-up. but if you ride trails a lot and your foot is always in and out it may be a hassle to get the pedal back into position to clip in.","Pedals are a decent, and a cheaper alternative to the Shimano equivalent. But the bearings and movement are not very smooth. If you want a set to teach someone how to use clipless pedals with a standard alternative, these are a decent choice. If you want a nice combo-pedal, get the Shimano.","I decided to try clipless pedals for the first time and these fit the bill. The non clip side is just like any normal pedal. The clip side works great and does have an adjustment for how tight or loose to set them. The pedals also came with a set of cleats which saves some money as with other pedals you have to buy those separate.","These pedals have a nice finished look on the bike and the tension adjusters seem to click and lock pretty well. I am new to clip-ins, but I expected a more \"secure feeling\" pedal. It seems that there is a little more torsional (twisting) play than what I expected. I am only riding on the road for now, but if I decide to hit it hard off road I will have to research a more solid set up.","I bought this item from Amazon a little over a week ago and have since already received it and installed the pedals to my bike. First impressions are good. I needed a pedal set that had more grip than my prior set (flat, double platform type pedals with no grip and slippery when wet). This pedal set also gives me the versatility if in the even I want to use clipless shoes, I can."],[{"answerText":"Lol, its a set, 2 pedals.","answerType":"NA","helpful":[4,4]},{"answerText":"Came with two pedals in the box AND a fresh set of cleats and screws for the shoes.","answerType":"NA","helpful":[2,2]},{"answerText":"This was for two pedals. They also came with cleats.","answerType":"NA","helpful":[2,2]},{"answerText":"Yes, it is a set(2) pedals.","answerType":"NA","helpful":[1,1]},{"answerText":"It is a set of 2","answerType":"NA","helpful":[1,1]},{"answerText":"It's a set of two","answerType":"NA","helpful":[0,0]},{"answerText":"The pedals come in a set of two. I had trouble with the left pedal not releasing properly and will exchange them for another set.","answerType":"NA","helpful":[0,0]}],1,27],["B0006U10LM","Sports_and_Outdoors","I have had an under-counter installation for over a year. I just replaced the filter and now my faucet does stop as quickly as it used to. What's up?","descriptive",["This is an improvement over the countertop version that tends to fall over a lot. There's also no tubes to get tangled up around the faucet. Easy to install under the counter and works great. Looks nice. Best staged filter I've ever used.","For several years we have used a counter-top Brita filter. That meant changing the filter every two months and cleaning the container about every week. The Enviro Conversion Kit installed easily and now we have filtered water at the kitchen sink.I did remove our soap container and used that opening for the filter. We already had a cold water supply valve under the sink which made things very easy. It was necessary to go to the hardware store for one coupler, but who doesn't want to go to the hardware?","My wife and I have been using the above counter 10 stage water filter for years. Each year we get a new cartridge and enjoy the peace of mind and good taste from water system. We got a new sink installed yesterday  and after the plumber left I got the kit out to put in a new UNDER the counter water filter system. I mean, how hard can it be. The old unit above the counter was a snap, I've been a technician for 25 years and I do LOTS of home repairs.","Even though I bought this unit as used with a few previous owner induced problems (cut hoses and no directions) a quick call to Enviro and they handled these issues quickly and professionally. Hooked up and working fine.","I love the filter itself, but our new faucet doesn't take the counter top model. The first time I installed it, it was leaking, and in the process of fixing this leak, it broke, and I had to buy a whole new unit. Now it doesn't leak, but it also doesn't work. Several complained about slow water, but in mine, it just doesn't even go. It sounds like from the other reviews that this product is simply not there.","When I ordered this kit I never expected it to look so good and the functionality is great. No more pulling buttons on the faucet and making sure it's not hot water coming through.Just surprised that it comes with all the parts you need, including a new filter holder. Frankly it's not a conversion kit but it's the complete deal minus a filter. Anyone want to buy my old counter-top parts? ;-)","I had the original, sit-on-the-counter, filter for a couple of years and was very happy with it. The water it produced seemed just as good as the RO system we had previously, but it doesn't waste so much water. When we moved to our new home, the counter-top system would not work with the pull down spray faucet, so we needed to purchase the conversion kit. $150 for a plumber to install, but still cheaper than the RO system.","This kit works well, once you get it in. Installation was not difficult in the end, but...1)It was delivered without any instructions at all. Luckily the manufacturer of the filter we bought at the same time has a very friendly and efficient customer service department that promptly emailed us an instruction sheet.2) The kit comes with parts for two separate installation methods-- using a saddle valve, or tee-ing off of the cold water valve to your faucet.","i like this product and ordered one after checking out my friend's setup. my filter was previously sitting on the counter with faucet attachment. the problem with the conversion kit i got is that the \"L\" shaped mounting bracket in no way at all fits to the filter housing. so basically i cannot mount it under the sink. it also does not look like the bracket that is pictured in the instructions. so  ?","Matches the brushed look of the rest of the sink and faucet. My only concern is the amount of water wasted once you turn it off by the handle. Good pressure. Should be able to give up the bottled water now that I have filtered water again. Previously used a PUR, which I was pleased with but the new house had a sprayer faucet."],[{"answerText":"I had this problem from day one and found that a smooth slow shut off will eliminate the drip in the directions it mentions a water pressure regulator I believe that would probably end the problem.....Just a guess","answerType":"NA","helpful":[0,0]},{"answerText":"I also did that and it did seem to help.","answerType":"NA","helpful":[0,0]}],1,28],["B001M0KQ8S","Electronics","can i hook these up to my vizio led tv?  Are they HDMI compatible?  I do not have a receiver.  I just want to hook them up to my tv","descriptive",["I bought these speakers because they are very small and just want I wanted. i thought i could connect them to my Samsung LED TV. That has not been successful, I don't have a receiver and have no clue what I'm doing. What I can review is Edifier's customer service. They are great. They obviously care if you are happy with their product. Ming Chen, the Customer Service Rep that assisted me went above and beyond trying to get me set up.","It was for a computer not a DVD system for 5.1 channel home theater. Had to return it. Besides it looked cheap. Most computer hook ups use USB cables. This had small plug ins.","What a sweetheart. I will not hesitate to purchase another product from Edifier.","I bought this product to be hooked up with my laptop. It's working just fine and I don't have any problem.The sound quality is good. If you are not too picky about the sound quality, you will be satisfied with this product.The only drawback is my laptop doesn't support 5.1ch sound but that's nothing to do with this product.Overall, I'm pretty happy with it.","While the item works, it does not come with all the adapters needed to get even good sound. Definitely not a unit for those looking for even adequate sound.","When using this system, you would think you are at the movie theater. It is so powerful, it makes watching movies so much more enjoyable."],[{"answerText":"Should be ok. Gota hav audio out on tv. Most tv do. No HDMI. Dont need it for sound.","answerType":"NA","helpful":[0,0]},{"answerText":"I made the mistake of buying this thing thinking it was for a TV...its for a computer with a 5.1 sound card. it has like 5 different input s you need to hook up to the sound card. unless you have a TV with a sound card which I doubt it won't work it's for a laptop or PC. so now I'm sitting here with this surround system that I can't use... or at least not until I get a computer with a 5.1 sound card.","answerType":"NA","helpful":[0,0]},{"answerText":"THey are not HDMI compatible.  You'd need an audio HDMI converter to hook them up to your TV.","answerType":"NA","helpful":[0,0]}],1,29],["B00CRPAHKE","Automotive","2 piece. Is this 2 hoses and 2 valves? Or 1 hose 1 valve","descriptive",["2 is 1 and 1 is none. Get these siphons! They are great! No more spilling gas when filling up my tank. Just put the hose in shake to start the siphon and it will transfer 5 gallons in a few minutes. I have 1 for gas and one for water. I will never suck on a hose again.","The Hoses syphon quite well.Con- Hoses are really stiff. The Should be like 10 or 12 ft long, I would rather cut off excess than go to home depot and buy a connector and more hose.","It is awesome, but a little more expensive than regular cans. Worth it, just like these hoses.","Purchased hose to siphon gas from my VW Passat's gas tank. The brass valve would not fit down into the gas tank. I don't know if this issue is specific to my car or if the product is not intended to siphon from a car tank. If the later is true, the description should have stated that it's not for car use. Either way it did not work as intended. On the plus side, it seems to be well made and should work siphoning from something with a larger access point.","Bought one of these for my boat from another vendor. Works great, no mess. Wanted one for a gift and when I saw this price for 2, can't beat it. Now I have one for home too! Shipping was fast as well.","One didn't work at all and the other not very well. The hose isn't flexible in the winter time. I would not suggest buying this.","Don't risk gasoline in the mouth! This siphon is so easy to use and affordable that using any other siphon is foolhardy. Just set up the hose between the containers with the source container higher than the receiving container, joggle the brass end up and down in the source container, and before you know it the siphon will be flowing.","Worked great. Vinyl hose tends to get stiff if stored in the garage during cold weather. I suggest storing them indoors after use. Be sure to siphon water through first to clean out, for example, gasoline residue. To avoid them coiling up, then store hung extended in the basement. Ohio Stevo","Should put those CA regulators on notice that this is much moore effective and 100 or 1000 times easier to use than those gizmos attached to gas cans that spill more gas than not becuase they have to be lifted and poured. A large funnel with no gizmo is even better but nothing like the Shaker. I empty my hot tub same way with garden hose and may make my own shaker. KISS is always a good theme. Bill Tageson","This is a wonderful produce worth investing in if you have need to do a lot of siphoning around your environment. I plucked the hose in a 50 gallon barrel filled with rain water, jiggles the brass end several times and it began draining instantly without further intervention on my part. Clean and \"safe\" to use. Only thing I didn't like of the product was the hose was only 6 foot long so I had to add an extension in order to empty the barrel away from my foundation."],[{"answerText":"Two complete assemblies.","answerType":"NA","helpful":[1,1]},{"answerText":"2 hoses, 2 valves","answerType":"NA","helpful":[1,1]},{"answerText":"Two complete assemblies.","answerType":"NA","helpful":[1,1]},{"answerText":"It is a hose with a valve installed and there are two of them.","answerType":"NA","helpful":[1,1]},{"answerText":"2 hoses and 2 valves. Works like a dream!","answerType":"NA","helpful":[1,1]},{"answerText":"two hoses and two valves.","answerType":"NA","helpful":[1,1]},{"answerText":"This is 2 complete sets of one hose with one attached valve per set.  I got this so I could use one and give one to my son.","answerType":"NA","helpful":[1,1]},{"answerText":"Two complete separate  units.Two for one.","answerType":"NA","helpful":[1,1]}],1,30],["B00EE30O9Q","Health_and_Personal_Care","I received two identical belts (look like A, I think) and the hip belt.  Is it supposed to be three DIFFERENT belts?","descriptive",["For the price this can't be beat. Only problem is the size. I am tall and skinny and wear a 27 pant size. That being said, I could BARELY stretch the hip band around my hips. It was very tight people. I haven't tried the waist bands yet because I am still pregnant, but they too look pretty small. I still think this product will work for me, but if you are any bigger don't even bother.","3rd baby here. This is the best postpartum belt I've had. I used to use the standard one had Motherhood Maternity sells. This one is great because there are three separate ones so you can overlap them to prevent roll down, or even suck in those inevitable back rolls that would show when using one of these belts. Love these. They are stiff enough to provide good support and prevent uncomfortable rolling, but they're still comfy.","After ordering a lot of things off Amazon FINALLY a product I can keep and enjoy it will not be returning. It came earlier than expected and in great condition. I love having the three belts I can wear two or all this was well worth the price. Yes it does not have instructions BUT were all made different so the way you put it on may not be the way I could wear it and be comfortable. So play with it and make it fit for you.","I had no trouble figuring out which piece went on first...but if you are lost just look at the picture on the web here. It came with no instructions but none were needed. Just open the package put on the top piece under bra, strap middle piece on over beeely button area, last strap the lower abdomen piece around upper hip area. It is not uncomfortable to wear even to sit down.","No instructions, but they work great. Thick durable material. I've used one and all three at a time. To get a better feel and look, I wear them over a fitted tank top for comfort against my skin and I've also mixed bands up so that one fastens in the back to get a tighter, flatter look under clothing.","I was skeptical about the quality of this but it is good quality. I bought this for my diastasis recti condition and I really think it is working. I was wearing another one piece Velcro belt for 6 weeks, and then starting using this one, it's only been 4 days of constant use, but I really think it's working. Product does run small, mine was a size F (not sure what that means). I am a size 11 but I do have a smaller waist.","AMAZING! I had horrible SPD during pregnancy and it only got WORSE after birth. Between sore muscles from a natural childbirth and SPD pain, I was barely able to walk, get out of bed, or pretty much do anything. This belt helped give me the back, tummy, and hip support that I needed to be able to be functional. Material is soft- much softer than a product I got from BRU.","It doesn't come with instructions but if you have any common sense at all you will know how to put it on. And the description clearly states the size of each band.With that said, I actually like these bands. With my first child, I got a band from motherhood, but it only covered my lower belly. I like that these cover from my ribs down to my hip and you can adjust each band to your body shape. They are strong and hold everything down.","This is for a tiny person . Not for us chunky girls. I bieve this runs very small. You have to order this at least two sizes bigger than what you are. The good thing is if you don't like it you get your money back just as long as you don't remove tags. Try it on, if you don't like it return it. Not bad.","Lost my baby bump two weeks after giving birth thanks to this belt. Wear it for several days in a row, take off only for showers.You will see a huge difference ."],[{"answerText":"yes its 3 to customize thefit","answerType":"NA","helpful":[1,1]},{"answerText":"Yes , I have received 3 diff belts, though 2 of them look alike there is difference in elastics and slight size too","answerType":"NA","helpful":[1,1]}],1,31],["B0098FKL1Q","Cell_Phones_and_Accessories","will this work for iPhone 5c","yesno",["I love not having to carry a wallet! This works perfectly and still protects my phone!"],[{"answerText":"No it only fits the 5 and 5s","answerType":"N","helpful":[1,1]},{"answerText":"My daughter has that phone. We tried it. It did work but was a much tighter fit. So really i wouldnt buy it for that phone. It goes on really easy for the 5","answerType":"NA","helpful":[1,1]},{"answerText":"Yes","answerType":"Y","helpful":[0,1]}],0,32],["B00CXNHJAQ","Electronics","Does the player come with hdmi cable?","descriptive",["For the price it meets all the requirement's I need. It small and easy to operate. Used HMI cable and have bright clear 1080p picture on my Sony TV.","The very first DVD I put in it was brand new never watched and it skipped during the movie. Every movie afterwards has skipped. It has been only one or two skips about 2 to 3 seconds each on each movie. It has done it on new as well as previously watched movies."],[{"answerText":"No, it does not.  Some advise, don't be fooled into buying \"High\" quality HDMI cables, they are no better than low cost cables.  Amazon has some available in different lengths that are very good, and at a low cost.  I have yet to see someone show me that a high quality cable is better, I've never been able to see any difference at all.  All the hype is just a way to part you of your hard earned dollars.","answerType":"NA","helpful":[10,12]},{"answerText":"It has a HDMI connector but the cable does not come in the box.","answerType":"NA","helpful":[3,3]},{"answerText":"it does not come with HDMI cable","answerType":"NA","helpful":[2,3]},{"answerText":"I have the player but what is a hdmi?","answerType":"NA","helpful":[0,5]}],0,33],["B005ZCY36K","Toys_and_Games","Does the junior tag reader have an earphone jack?","descriptive",["from quizzes, read-alongs, and games, this pretty much just says 1-2 phrases per page of the board books you buy to go along with the reader device. So for instance in the Disney princess Tag Junior book, when you hold the reader over Cinderella you'll hear Cinderella's voice through the reader, but she only says one thing. On one page it says something like \"find Cinderella's crown on this page\" so there is that type of challenge.","These books are working out great for my grandson. He loves being in charge of the book! He is picking up on many sight words with the Tag reader!","No value there, but nonetheless the leap tag junior book pal is a nice little toy that's worth checking out.","i love this toy and my son loves it too, i buoght for his birthday his first tag junior book animals around the worldwe still didn't show him coz his birth day in the next monthand i wish we could buy more books for him","The Leapreader Junior has 1\/4 the memory (about 5 to 6 books) and CANNOT use regular Tag Leapreader books (the regular Tag Leapreader can use the Leapreader Junior books).Save yourself the hassle and just pony up for the regular Tag Leapreader.","I've started giving Tag Junior as B-day gifts to our friends. The beauty of this is since the system only holds a couple of books, we trade books which keeps our library growing and costs down. The books as well as Scout are very sturdy and hold up well.","I thought this would be a perfect toy for my daughter who LOVES books. However, all she does with it now is turn it on and off and push the volume button. I've seen her sit down and use it correctly twice. It has withstood her throwing it and banging it on things. She enjoys the My Pal Violet, but isn't quite ready for the Tag Junior yet.","And FYI, the Tag pen WILL read the older level Tag books as well as the Tag Junior books. It may save you some money to just buy the Tag reading system if this product works well for your child and you want it to advance with him\/her. I didn't know that at the time I purchased this, but really wish I did.","Im only giving this 4 stars because I was unaware, upon buying this product that any additional books or products for tag junior have to be programed... You must download the audio from an application you download off the leapfrog website. Just a pain in the butt really.. Although the book that comes with this set does work with the puppy right out the box, the book kinda sucks.","I am happy with the overall concept and performance of the Tag Junior system; however, I am disappointed to find that it doesn't hold that many books. It comes with a short vowel book set, and in addition to that I purchased several other books. When I took it home, I discovered that after downloading the short vowel book set, there was only enough memory for two more books."],[{"answerText":"no, it doesn't","answerType":"NA","helpful":[1,1]},{"answerText":"No it doesn't.","answerType":"NA","helpful":[0,0]}],1,34],["B003IPNH9U","Electronics","what is power output of this power cord?","descriptive",["I was pleased to find this power cord so I can once again use my video camera. It works great.","power adapter- working very well with phone","Works perfectly. Our old cord had the end break off.I can always count on Amazon to supply the weird odds and ends we break around our house!","this adapter turned out not to be the one that was advertised for the Innotab2S, it did however work with the E=Reader that I have for my grandchild, that is why I kept it and did not return it. Product was new as promised.","Worked as described. Works like original charger. Zero issues!!! !","This product works on my jvc camcorder (gz-mg360bu). I'm very pleased with this item and for the price, can't be any happier.","This is also good to have when traveling using an AC\/Dc Inverter, to keep your camcorder battery charged. It is what I needed! Recommend Highly!","This is a great one for my old JVC hard drive camcorder. I gave this five stars because it works excellent.","Received the product exactly as described, it came very quickly and works great. I would highly recommend this business to anyone.","Pretty much like original one that was lost during our move. Weird form factor that I never understood. Does what it does at a fair price. No Pros or Cons on this little guy."],[{"answerText":"11 Volts DC","answerType":"NA","helpful":[1,1]},{"answerText":"Hi Robert,The output printed on the side of this adapter is DC 11 volts 1Amp. Hope this helps. Nile","answerType":"NA","helpful":[1,1]}],1,35],["B00GM32L1U","Home_and_Kitchen","Does this unit have an internal thermostat that shuts the compressor off when set temperature has been reached?","descriptive",["We are very, very pleased with our Friedrich 15,000 BTU energy star air conditioner. We did have a professional install it through the wall but it went in easily, it runs quietly and is easy to control with the remote. We just set it on the temperature we want and it cycles on and off automatically to keep our large room comfortable.","We have had 3 different units in this window over the years we have owned the house, and this is by far the best performing and quietest unit of the three. It is a beast that has conquered the hot Texas sun. We love it.","My unit arrived demolished. i had it shipped to the office and fedex delivered it without my signature at lunch. The unit ships in a carton meant for retail store shelves. Stores receive the units stacked and strapped to a pallet. The single unit packaging is simply inadequate to ship from one coast to the other.I love Amazon but they need to find a better way to ship heavy items.I ended up finding a local dealer who had them in stock for the same price.","We just received our first full month's electric bill and it was so much lower than we anticipated that we couldn't be happier. Highly recommend the Friedrich air conditioner.","The Good:Here's the thing. I have a studio apartment that is difficult to cool. I have tried several big name air conditioners in the 12,000-15,000 btu and all have failed to satisfy my need. The Friedrich on middle speed has more flow than any of the others on high. The Friedrich on high is a cooling monster, beyond compare.The Bad: I gave the review 5 stars based on the air conditioners quality and performance.","If anyone receives one in tact it has to be the exception."],[{"answerText":"Yes, it does.  Very convenient.","answerType":"NA","helpful":[0,0]},{"answerText":"Yes. This is a fully digital unit which allowes for temperature control","answerType":"NA","helpful":[0,0]},{"answerText":"Yes. It's a great unit!","answerType":"NA","helpful":[0,0]},{"answerText":"yes it does","answerType":"NA","helpful":[0,0]},{"answerText":"yes, of course.  works very well.","answerType":"NA","helpful":[0,0]},{"answerText":"Indeed it does!","answerType":"NA","helpful":[0,0]}],0,36],["B003E7UPFG","Home_and_Kitchen","Can someone please post closeup pictures of the color?  Is it true bright white, off-white, cream, etc?","descriptive",["When we moved back to New York State; we were afraid that the white furniture wouldn't fit in with the rest of our decor. To our delight; both pieces look just as nice in our northern environment as they did in the south. Another aspect of the quality of this furniture is that it survived unscathed through a terrible move from FL to NY. While the movers managed to damage our mattress, large screen TV and several other things, our dressers from Coaster arrived in perfect condition.","When we lived in Florida, my wife purchased this beautiful Coaster storage dresser with the mirror from a Macy's overstock store in Bradenton. At the same time; I purchased the Coaster Classic Eight Drawer Chest in White Finish. I have to tell you; these are beautiful looking pieces of quality made furniture. The picture of this gorgeous dresser doesn't do justice to the sheer beauty of it in person. What is especially rich looking, are the glass panel doors to either side of the 3 main drawers.","You won't be disappointed, the craftsmanship and quality is 10 stars.Love the style, beauty, and top felt lines drawer to put jewelry or other delicates, the top 3 all our lined ;p =)Great, awesome *~*~*","This particular one comes with 5 drawers on the outside and 6 more on the inside, behind the glass panels. The total of 11 drawers gives you an immense amount of space to store your clothing or whatever. The top center drawer is lined with a lush, soft velvet type material. It's an excellent place to store jewelry. The quality of each piece of furniture is first rate, with both dressers having 5 legs, not 4.","This is a very high quality piece of furniture. The glides on the drawers are fabulous. My only complaint is that the little drawers on the sides are a bit of a pain to access because you have to open the covering door and then pull the drawer out. Not that big of a deal but when you are doing it a couple times a day, it's an extra step.","This dresser is gorgeous! Everyone that sees it comments on how lovely it is. Arrived well packed and undamaged despite a vigorous shipping process to the Caribbean. Looks gorgeous in our bedroom. Highly recommended!","This dresser is beautiful the picture does not do justice! The dresser is great quality and I could not ask for a better product! I didn't even have to assemble which was great.","It is a beautiful piece of furniture..it matches the bed exactly... and the packing was done very well  We like it, but the drawers are smaller than we anticipated. (We switched from a chest of drawers). We will get tired of the glass doors... yes, our own doing I know. So (I'm just saying), think about functionality before you get swept up by the beauty!","I read great reviews about this dresser and they were right! It is beautiful and of good quality. Treat it gently, this is a great piece of furniture.","I LOVE my new dresser. It has more space than I imagined and is very well made. Looks like a very rich piece of PB furniture without the price tag."],[{"answerText":"I bought this piece a year ago, great dresser. My phone wasn't cooperating with me to post a close up picture, however it's an off-white. My Master is Gray and white and even though it's not a bright white it's not yellowish or anything. It goes very well with my all bright white bed and bedding. You can't tell its slightly off at all. I hope this helps. I will try to post a picture for you :)","answerType":"NA","helpful":[0,0]},{"answerText":"I would say this piece is pretty white, if not just a tad off-white. It matches my daughter's white bed and desk very well.","answerType":"NA","helpful":[0,0]},{"answerText":"Not cream, not off white, not blinding bright white...but it is white!","answerType":"NA","helpful":[0,0]},{"answerText":"It is a off creamy white, not stark white. still beautiful.","answerType":"NA","helpful":[0,0]}],0,37],["B004RDT1II","Home_and_Kitchen","Does anyone sell replacement outer covers for this model?.","descriptive",["How Bissell can sell this in good conscience is beyond me.","My second vacuum of this same model...a winner, folks! My last one lasted 10 years and I'm pleased to own yet another.","I'm really happy with this particular model... we'll see how well it holds up over time. I have not tried it on the floor yet, but when I do, I will write another review.","One tip....this particular model is made for a big name retailer that is known for \"rolling back\" prices. You might want to check there first...the prices are much better than the models for sale on here.","I bought this along with a budget canister vac for my spring cleaning this year. I love this upright for carpets. The brush roll is height is manually adjustable...much better for different cleaning surfaces than a model that is supposedly automatic.Carpet performance is great...one pass and typical light soil is GONE. Pet hair performance is wonderful...I have a dark brown commercial mat at my front door that I despaired of getting clean. A couple of passes and it looks like new.","Absolutely none! I again, called Bissell who then informed me that I needed to take it to a Bissell store in my area. Which happened to be on the other side of this large city. We do not drive, and locking down a ride between anyone else schedule, and my schedule as a mom, with a full time job, has been almost as tedious as dealing with Bissell themselves.I don't hate many products, but this is one I can safely say, I HATE.","This vacuum broke in less than a year. When I called Bissell they informed me that it's regular wear and tare. I'm not sure how the whole head of the vacuum to stop working is regular wear and tare. So after informing them of how atrocious this was, they agreed to send me a replacement piece. Awesome, right? No, not even a little bit. We waited 10 business days for this piece to arrive. Once it did, we came to realise that it was just the roller brush.","this vacum arrived very quickly, i have a cleaning and janitorial business and i love these vacums. i love shopping thru amazon!","piece of junk--no good suction-same identiccal unit sells in walmart for 47.00,.  boy, didI get tattoed from you....never againjim","love this vacuum. i'll buy more before they discover that they have a gold mine and raise the price."],[{"answerText":"There is one sellar I found at Vac Parts Warehouse search for Bissell Bag Door Assembly #2035579.  Amazon also has it from the same sellar Bissell Bag Door Assembly #2035579  However, it is a whopping over $17 and that does not include shipping!  There is one for about $15 on Ebay that includes shipping (search \"Bissell Vacuum Cleaner Power Force Powerforce Front Bag Door Assembly Cover\")But I have seen these vacuums quite often at Thrift Stores for very cheap.  Good luck.  I love this vacuum!","answerType":"NA","helpful":[1,1]},{"answerText":"I'm sorry I'm not really sure....try home depot\/Lowe's or other hardware stores?","answerType":"NA","helpful":[0,0]}],0,38],["B00306FNUS","Health_and_Personal_Care","what does the bgrv kit come with? any blades, combs, oil etc?","descriptive",["Can't wait to use this clipper at work. Just waiting on the attachment combs since I wasn't sure if they were included in the box. It comes with clipper oil and a 1 blade. So if you want more blades or the comb attachments make sure to order them as well.","I am a professional cosmetologist. The percentage of male clients vs. female clients is 70\/30, so my clippers are running the majority of any given day. I love the variable speeds as I work on so many different hair textures and densities. These clippers are spot on, and all of my oster blades fit the And is bgrv, so I didn't have to make an additional investment. I couldn't be happier!","I bought these for myself a couple years ago as a birthday present. I use them one a week to cut my hair, and once a month to cut my dogs hair. The variable speeds really come in handy with the dogs. These clippers are great! Spend the extra bucks and get the ceramics blades. The standard metal blades heat up pretty quickly under normal use. On my bald head, that doesn't feel so great. The ceramic blades never get hot.","It didn't matter because I ordered a separate blade for my ideal cut, but others might be affected if they expect a specific blade with the clipper kit.","I got The Andis ceramic Bgrv variable speed clipper. this is the only clipper that can compete with the oster 76. Its better than the 76 because its more quite and it has variable speed for all hair density","As a professional, licensed cosmetologist with heavy barber experience, I feel that I can weigh this rating pretty evenly. The bgrv is everything you'd expect from a top of the line Andis clipper. It operates smoothly, quietly, and effectively.","I continue to realize that you ALWAYS GET WHAT YOU PAY FOR and in this situation it's the same. If you buy a Remington (like) clipper, you may have it for years, but you will NOT know the difference in the quality of your haircut and coolness of the blade contacting your skin until you use the Andis BGRv (Model #63100).","I had bought these Clippers a year ago and wow have things changed since then. This manufacturer is making the Bgrv look bad and cheap. I had to go ship them back because I thought it was a joke. They were loud and the metal hinge wasn't even metal it was plastic. The picture that's being posted doesn't look like what they sent me..","We did buy the additional 5\/8\" blade for paws but returned it because it was was dull and useless. I would actually go the opposite way, and buy a finer blade to finish off the facial areas and paws after going over it with the coarser #10.It came with blade oil. I also purchased the cool blade spray to use while cutting for a quick clean & cooling off.","However, I could easily continue clipping even with the hot blade since it was not uncomfortable. The only other downside is the cord, which only gets in the way a little, about as much as any cord would. The positives far outweigh the negatives. I can see using these clippers for years, and possibly getting the rechargeable battery kit. Anyone want to buy Oster Professional clippers for their dogs?"],[{"answerText":"It does not come with the guards \/grading combs. Called Andis and they said also order the Andis B & B Universal Comb Set 12995.","answerType":"NA","helpful":[1,1]},{"answerText":"Charles D. Isaac ,if you go to the comment page of Andis B&B; Universal Comb set #12995, Andrea Solinski says that these combs fit perfectly on BGRv Andis clipper....","answerType":"NA","helpful":[2,2]},{"answerText":"The Andis B&B; Universal Comb set #12995 does NOT fit the Andis Variable Speed #63100.......C.Isaac","answerType":"NA","helpful":[3,4]},{"answerText":"Which blade does this come with? 000?","answerType":"NA","helpful":[1,1]}],1,39]]}